MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
extern volatile IOCENbits_t IOCENbits __at(0x39E);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x39F);
#ifndef _LIB_BUILD
asm("IOCEF equ 039Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x39F);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: HIDRVB
#define HIDRVB HIDRVB
extern volatile unsigned char           HIDRVB              __at(0x40D);
#ifndef _LIB_BUILD
asm("HIDRVB equ 040Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HIDB0                  :1;
        unsigned HIDB1                  :1;
    };
} HIDRVBbits_t;
extern volatile HIDRVBbits_t HIDRVBbits __at(0x40D);
// bitfield macros
#define _HIDRVB_HIDB0_POSN                                  0x0
#define _HIDRVB_HIDB0_POSITION                              0x0
#define _HIDRVB_HIDB0_SIZE                                  0x1
#define _HIDRVB_HIDB0_LENGTH                                0x1
#define _HIDRVB_HIDB0_MASK                                  0x1
#define _HIDRVB_HIDB1_POSN                                  0x1
#define _HIDRVB_HIDB1_POSITION                              0x1
#define _HIDRVB_HIDB1_SIZE                                  0x1
#define _HIDRVB_HIDB1_LENGTH                                0x1
#define _HIDRVB_HIDB1_MASK                                  0x2

// Register: TMR5
#define TMR5 TMR5
extern volatile unsigned short          TMR5                __at(0x40F);
#ifndef _LIB_BUILD
asm("TMR5 equ 040Fh");
#endif

// Register: TMR5L
#define TMR5L TMR5L
extern volatile unsigned char           TMR5L               __at(0x40F);
#ifndef _LIB_BUILD
asm("TMR5L equ 040Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
} TMR5Lbits_t;
extern volatile TMR5Lbits_t TMR5Lbits __at(0x40F);
// bitfield macros
#define _TMR5L_TMR_POSN                                     0x0
#define _TMR5L_TMR_POSITION                                 0x0
#define _TMR5L_TMR_SIZE                                     0x8
#define _TMR5L_TMR_LENGTH                                   0x8
#define _TMR5L_TMR_MASK                                     0xFF

// Register: TMR5H
#define TMR5H TMR5H
extern volatile unsigned char           TMR5H               __at(0x410);
#ifndef _LIB_BUILD
asm("TMR5H equ 0410h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
} TMR5Hbits_t;
extern volatile TMR5Hbits_t TMR5Hbits __at(0x410);
// bitfield macros
#define _TMR5H_TMR_POSN                                     0x0
#define _TMR5H_TMR_POSITION                                 0x0
#define _TMR5H_TMR_SIZE                                     0x8
#define _TMR5H_TMR_LENGTH                                   0x8
#define _TMR5H_TMR_MASK                                     0xFF

// Register: T5CON
#define T5CON T5CON
extern volatile unsigned char           T5CON               __at(0x411);
#ifndef _LIB_BUILD
asm("T5CON equ 0411h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned                        :1;
        unsigned nSYNC                  :1;
        unsigned OSCEN                  :1;
        unsigned CKPS                   :2;
        unsigned CS                     :2;
    };
    struct {
        unsigned TMRON                  :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned SOSCEN                 :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned TMR5ON                 :1;
        unsigned                        :1;
        unsigned nT5SYNC                :1;
        unsigned T5OSCEN                :1;
        unsigned                        :2;
        unsigned T5CS0                  :1;
        unsigned T5CS1                  :1;
    };
    struct {
        unsigned T5ON                   :1;
        unsigned                        :3;
        unsigned T5CKPS0                :1;
        unsigned T5CKPS1                :1;
        unsigned TMR5CS0                :1;
        unsigned TMR5CS1                :1;
    };
} T5CONbits_t;
extern volatile T5CONbits_t T5CONbits __at(0x411);
// bitfield macros
#define _T5CON_ON_POSN                                      0x0
#define _T5CON_ON_POSITION                                  0x0
#define _T5CON_ON_SIZE                                      0x1
#define _T5CON_ON_LENGTH                                    0x1
#define _T5CON_ON_MASK                                      0x1
#define _T5CON_nSYNC_POSN                                   0x2
#define _T5CON_nSYNC_POSITION                               0x2
#define _T5CON_nSYNC_SIZE                                   0x1
#define _T5CON_nSYNC_LENGTH                                 0x1
#define _T5CON_nSYNC_MASK                                   0x4
#define _T5CON_OSCEN_POSN                                   0x3
#define _T5CON_OSCEN_POSITION                               0x3
#define _T5CON_OSCEN_SIZE                                   0x1
#define _T5CON_OSCEN_LENGTH                                 0x1
#define _T5CON_OSCEN_MASK                                   0x8
#define _T5CON_CKPS_POSN                                    0x4
#define _T5CON_CKPS_POSITION                                0x4
#define _T5CON_CKPS_SIZE                                    0x2
#define _T5CON_CKPS_LENGTH                                  0x2
#define _T5CON_CKPS_MASK                                    0x30
#define _T5CON_CS_POSN                                      0x6
#define _T5CON_CS_POSITION                                  0x6
#define _T5CON_CS_SIZE                                      0x2
#define _T5CON_CS_LENGTH                                    0x2
#define _T5CON_CS_MASK                                      0xC0
#define _T5CON_TMRON_POSN                                   0x0
#define _T5CON_TMRON_POSITION                               0x0
#define _T5CON_TMRON_SIZE                                   0x1
#define _T5CON_TMRON_LENGTH                                 0x1
#define _T5CON_TMRON_MASK                                   0x1
#define _T5CON_SYNC_POSN                                    0x2
#define _T5CON_SYNC_POSITION                                0x2
#define _T5CON_SYNC_SIZE                                    0x1
#define _T5CON_SYNC_LENGTH                                  0x1
#define _T5CON_SYNC_MASK                                    0x4
#define _T5CON_SOSCEN_POSN                                  0x3
#define _T5CON_SOSCEN_POSITION                              0x3
#define _T5CON_SOSCEN_SIZE                                  0x1
#define _T5CON_SOSCEN_LENGTH                                0x1
#define _T5CON_SOSCEN_MASK                                  0x8
#define _T5CON_CKPS0_POSN                                   0x4
#define _T5CON_CKPS0_POSITION                               0x4
#define _T5CON_CKPS0_SIZE                                   0x1
#define _T5CON_CKPS0_LENGTH                                 0x1
#define _T5CON_CKPS0_MASK                                   0x10
#define _T5CON_CKPS1_POSN                                   0x5
#define _T5CON_CKPS1_POSITION                               0x5
#define _T5CON_CKPS1_SIZE                                   0x1
#define _T5CON_CKPS1_LENGTH                                 0x1
#define _T5CON_CKPS1_MASK                                   0x20
#define _T5CON_CS0_POSN                                     0x6
#define _T5CON_CS0_POSITION                                 0x6
#define _T5CON_CS0_SIZE                                     0x1
#define _T5CON_CS0_LENGTH                                   0x1
#define _T5CON_CS0_MASK                                     0x40
#define _T5CON_CS1_POSN                                     0x7
#define _T5CON_CS1_POSITION                                 0x7
#define _T5CON_CS1_SIZE                                     0x1
#define _T5CON_CS1_LENGTH                                   0x1
#define _T5CON_CS1_MASK                                     0x80
#define _T5CON_TMR5ON_POSN                                  0x0
#define _T5CON_TMR5ON_POSITION                              0x0
#define _T5CON_TMR5ON_SIZE                                  0x1
#define _T5CON_TMR5ON_LENGTH                                0x1
#define _T5CON_TMR5ON_MASK                                  0x1
#define _T5CON_nT5SYNC_POSN                                 0x2
#define _T5CON_nT5SYNC_POSITION                             0x2
#define _T5CON_nT5SYNC_SIZE                                 0x1
#define _T5CON_nT5SYNC_LENGTH                               0x1
#define _T5CON_nT5SYNC_MASK                                 0x4
#define _T5CON_T5OSCEN_POSN                                 0x3
#define _T5CON_T5OSCEN_POSITION                             0x3
#define _T5CON_T5OSCEN_SIZE                                 0x1
#define _T5CON_T5OSCEN_LENGTH                               0x1
#define _T5CON_T5OSCEN_MASK                                 0x8
#define _T5CON_T5CS0_POSN                                   0x6
#define _T5CON_T5CS0_POSITION                               0x6
#define _T5CON_T5CS0_SIZE                                   0x1
#define _T5CON_T5CS0_LENGTH                                 0x1
#define _T5CON_T5CS0_MASK                                   0x40
#define _T5CON_T5CS1_POSN                                   0x7
#define _T5CON_T5CS1_POSITION                               0x7
#define _T5CON_T5CS1_SIZE                                   0x1
#define _T5CON_T5CS1_LENGTH                                 0x1
#define _T5CON_T5CS1_MASK                                   0x80
#define _T5CON_T5ON_POSN                                    0x0
#define _T5CON_T5ON_POSITION                                0x0
#define _T5CON_T5ON_SIZE                                    0x1
#define _T5CON_T5ON_LENGTH                                  0x1
#define _T5CON_T5ON_MASK                                    0x1
#define _T5CON_T5CKPS0_POSN                                 0x4
#define _T5CON_T5CKPS0_POSITION                             0x4
#define _T5CON_T5CKPS0_SIZE                                 0x1
#define _T5CON_T5CKPS0_LENGTH                               0x1
#define _T5CON_T5CKPS0_MASK                                 0x10
#define _T5CON_T5CKPS1_POSN                                 0x5
#define _T5CON_T5CKPS1_POSITION                             0x5
#define _T5CON_T5CKPS1_SIZE                                 0x1
#define _T5CON_T5CKPS1_LENGTH                               0x1
#define _T5CON_T5CKPS1_MASK                                 0x20
#define _T5CON_TMR5CS0_POSN                                 0x6
#define _T5CON_TMR5CS0_POSITION                             0x6
#define _T5CON_TMR5CS0_SIZE                                 0x1
#define _T5CON_TMR5CS0_LENGTH                               0x1
#define _T5CON_TMR5CS0_MASK                                 0x40
#define _T5CON_TMR5CS1_POSN                                 0x7
#define _T5CON_TMR5CS1_POSITION                             0x7
#define _T5CON_TMR5CS1_SIZE                                 0x1
#define _T5CON_TMR5CS1_LENGTH                               0x1
#define _T5CON_TMR5CS1_MASK                                 0x80

// Register: T5GCON
#define T5GCON T5GCON
extern volatile unsigned char           T5GCON              __at(0x412);
#ifndef _LIB_BUILD
asm("T5GCON equ 0412h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned                        :5;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO_nDONE            :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned TMR5GE                 :1;
    };
    struct {
        unsigned T5GSS0                 :1;
        unsigned T5GSS1                 :1;
    };
} T5GCONbits_t;
