MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
// Register: DAC3REF
#define DAC3REF DAC3REF
extern volatile unsigned char           DAC3REF             __at(0x595);
#ifndef _LIB_BUILD
asm("DAC3REF equ 0595h");
#endif
// aliases
extern volatile unsigned char           DAC3CON1            __at(0x595);
#ifndef _LIB_BUILD
asm("DAC3CON1 equ 0595h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC3R                  :5;
    };
    struct {
        unsigned DAC3R0                 :1;
        unsigned DAC3R1                 :1;
        unsigned DAC3R2                 :1;
        unsigned DAC3R3                 :1;
        unsigned DAC3R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC3REF0               :1;
        unsigned DAC3REF1               :1;
        unsigned DAC3REF2               :1;
        unsigned DAC3REF3               :1;
        unsigned DAC3REF4               :1;
    };
} DAC3REFbits_t;
extern volatile DAC3REFbits_t DAC3REFbits __at(0x595);
// bitfield macros
#define _DAC3REF_DACR_POSN                                  0x0
#define _DAC3REF_DACR_POSITION                              0x0
#define _DAC3REF_DACR_SIZE                                  0x5
#define _DAC3REF_DACR_LENGTH                                0x5
#define _DAC3REF_DACR_MASK                                  0x1F
#define _DAC3REF_DACR0_POSN                                 0x0
#define _DAC3REF_DACR0_POSITION                             0x0
#define _DAC3REF_DACR0_SIZE                                 0x1
#define _DAC3REF_DACR0_LENGTH                               0x1
#define _DAC3REF_DACR0_MASK                                 0x1
#define _DAC3REF_DACR1_POSN                                 0x1
#define _DAC3REF_DACR1_POSITION                             0x1
#define _DAC3REF_DACR1_SIZE                                 0x1
#define _DAC3REF_DACR1_LENGTH                               0x1
#define _DAC3REF_DACR1_MASK                                 0x2
#define _DAC3REF_DACR2_POSN                                 0x2
#define _DAC3REF_DACR2_POSITION                             0x2
#define _DAC3REF_DACR2_SIZE                                 0x1
#define _DAC3REF_DACR2_LENGTH                               0x1
#define _DAC3REF_DACR2_MASK                                 0x4
#define _DAC3REF_DACR3_POSN                                 0x3
#define _DAC3REF_DACR3_POSITION                             0x3
#define _DAC3REF_DACR3_SIZE                                 0x1
#define _DAC3REF_DACR3_LENGTH                               0x1
#define _DAC3REF_DACR3_MASK                                 0x8
#define _DAC3REF_DACR4_POSN                                 0x4
#define _DAC3REF_DACR4_POSITION                             0x4
#define _DAC3REF_DACR4_SIZE                                 0x1
#define _DAC3REF_DACR4_LENGTH                               0x1
#define _DAC3REF_DACR4_MASK                                 0x10
#define _DAC3REF_R0_POSN                                    0x0
#define _DAC3REF_R0_POSITION                                0x0
#define _DAC3REF_R0_SIZE                                    0x1
#define _DAC3REF_R0_LENGTH                                  0x1
#define _DAC3REF_R0_MASK                                    0x1
#define _DAC3REF_R1_POSN                                    0x1
#define _DAC3REF_R1_POSITION                                0x1
#define _DAC3REF_R1_SIZE                                    0x1
#define _DAC3REF_R1_LENGTH                                  0x1
#define _DAC3REF_R1_MASK                                    0x2
#define _DAC3REF_R2_POSN                                    0x2
#define _DAC3REF_R2_POSITION                                0x2
#define _DAC3REF_R2_SIZE                                    0x1
#define _DAC3REF_R2_LENGTH                                  0x1
#define _DAC3REF_R2_MASK                                    0x4
#define _DAC3REF_R3_POSN                                    0x3
#define _DAC3REF_R3_POSITION                                0x3
#define _DAC3REF_R3_SIZE                                    0x1
#define _DAC3REF_R3_LENGTH                                  0x1
#define _DAC3REF_R3_MASK                                    0x8
#define _DAC3REF_R4_POSN                                    0x4
#define _DAC3REF_R4_POSITION                                0x4
#define _DAC3REF_R4_SIZE                                    0x1
#define _DAC3REF_R4_LENGTH                                  0x1
#define _DAC3REF_R4_MASK                                    0x10
#define _DAC3REF_DAC3R_POSN                                 0x0
#define _DAC3REF_DAC3R_POSITION                             0x0
#define _DAC3REF_DAC3R_SIZE                                 0x5
#define _DAC3REF_DAC3R_LENGTH                               0x5
#define _DAC3REF_DAC3R_MASK                                 0x1F
#define _DAC3REF_DAC3R0_POSN                                0x0
#define _DAC3REF_DAC3R0_POSITION                            0x0
#define _DAC3REF_DAC3R0_SIZE                                0x1
#define _DAC3REF_DAC3R0_LENGTH                              0x1
#define _DAC3REF_DAC3R0_MASK                                0x1
#define _DAC3REF_DAC3R1_POSN                                0x1
#define _DAC3REF_DAC3R1_POSITION                            0x1
#define _DAC3REF_DAC3R1_SIZE                                0x1
#define _DAC3REF_DAC3R1_LENGTH                              0x1
#define _DAC3REF_DAC3R1_MASK                                0x2
#define _DAC3REF_DAC3R2_POSN                                0x2
#define _DAC3REF_DAC3R2_POSITION                            0x2
#define _DAC3REF_DAC3R2_SIZE                                0x1
#define _DAC3REF_DAC3R2_LENGTH                              0x1
#define _DAC3REF_DAC3R2_MASK                                0x4
#define _DAC3REF_DAC3R3_POSN                                0x3
#define _DAC3REF_DAC3R3_POSITION                            0x3
#define _DAC3REF_DAC3R3_SIZE                                0x1
#define _DAC3REF_DAC3R3_LENGTH                              0x1
#define _DAC3REF_DAC3R3_MASK                                0x8
#define _DAC3REF_DAC3R4_POSN                                0x4
#define _DAC3REF_DAC3R4_POSITION                            0x4
#define _DAC3REF_DAC3R4_SIZE                                0x1
#define _DAC3REF_DAC3R4_LENGTH                              0x1
#define _DAC3REF_DAC3R4_MASK                                0x10
#define _DAC3REF_REF0_POSN                                  0x0
#define _DAC3REF_REF0_POSITION                              0x0
#define _DAC3REF_REF0_SIZE                                  0x1
#define _DAC3REF_REF0_LENGTH                                0x1
#define _DAC3REF_REF0_MASK                                  0x1
#define _DAC3REF_REF1_POSN                                  0x1
#define _DAC3REF_REF1_POSITION                              0x1
#define _DAC3REF_REF1_SIZE                                  0x1
#define _DAC3REF_REF1_LENGTH                                0x1
#define _DAC3REF_REF1_MASK                                  0x2
#define _DAC3REF_REF2_POSN                                  0x2
#define _DAC3REF_REF2_POSITION                              0x2
#define _DAC3REF_REF2_SIZE                                  0x1
#define _DAC3REF_REF2_LENGTH                                0x1
#define _DAC3REF_REF2_MASK                                  0x4
#define _DAC3REF_REF3_POSN                                  0x3
#define _DAC3REF_REF3_POSITION                              0x3
#define _DAC3REF_REF3_SIZE                                  0x1
#define _DAC3REF_REF3_LENGTH                                0x1
#define _DAC3REF_REF3_MASK                                  0x8
#define _DAC3REF_REF4_POSN                                  0x4
#define _DAC3REF_REF4_POSITION                              0x4
#define _DAC3REF_REF4_SIZE                                  0x1
#define _DAC3REF_REF4_LENGTH                                0x1
#define _DAC3REF_REF4_MASK                                  0x10
#define _DAC3REF_DAC3REF0_POSN                              0x0
#define _DAC3REF_DAC3REF0_POSITION                          0x0
#define _DAC3REF_DAC3REF0_SIZE                              0x1
#define _DAC3REF_DAC3REF0_LENGTH                            0x1
#define _DAC3REF_DAC3REF0_MASK                              0x1
#define _DAC3REF_DAC3REF1_POSN                              0x1
#define _DAC3REF_DAC3REF1_POSITION                          0x1
#define _DAC3REF_DAC3REF1_SIZE                              0x1
#define _DAC3REF_DAC3REF1_LENGTH                            0x1
#define _DAC3REF_DAC3REF1_MASK                              0x2
#define _DAC3REF_DAC3REF2_POSN                              0x2
#define _DAC3REF_DAC3REF2_POSITION                          0x2
#define _DAC3REF_DAC3REF2_SIZE                              0x1
#define _DAC3REF_DAC3REF2_LENGTH                            0x1
#define _DAC3REF_DAC3REF2_MASK                              0x4
#define _DAC3REF_DAC3REF3_POSN                              0x3
#define _DAC3REF_DAC3REF3_POSITION                          0x3
#define _DAC3REF_DAC3REF3_SIZE                              0x1
#define _DAC3REF_DAC3REF3_LENGTH                            0x1
#define _DAC3REF_DAC3REF3_MASK                              0x8
#define _DAC3REF_DAC3REF4_POSN                              0x4
#define _DAC3REF_DAC3REF4_POSITION                          0x4
#define _DAC3REF_DAC3REF4_SIZE                              0x1
#define _DAC3REF_DAC3REF4_LENGTH                            0x1
#define _DAC3REF_DAC3REF4_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC3R                  :5;
    };
    struct {
        unsigned DAC3R0                 :1;
        unsigned DAC3R1                 :1;
        unsigned DAC3R2                 :1;
        unsigned DAC3R3                 :1;
        unsigned DAC3R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC3REF0               :1;
        unsigned DAC3REF1               :1;
        unsigned DAC3REF2               :1;
        unsigned DAC3REF3               :1;
        unsigned DAC3REF4               :1;
    };
} DAC3CON1bits_t;
extern volatile DAC3CON1bits_t DAC3CON1bits __at(0x595);
// bitfield macros
#define _DAC3CON1_DACR_POSN                                 0x0
#define _DAC3CON1_DACR_POSITION                             0x0
#define _DAC3CON1_DACR_SIZE                                 0x5
#define _DAC3CON1_DACR_LENGTH                               0x5
#define _DAC3CON1_DACR_MASK                                 0x1F
#define _DAC3CON1_DACR0_POSN                                0x0
#define _DAC3CON1_DACR0_POSITION                            0x0
#define _DAC3CON1_DACR0_SIZE                                0x1
#define _DAC3CON1_DACR0_LENGTH                              0x1
#define _DAC3CON1_DACR0_MASK                                0x1
#define _DAC3CON1_DACR1_POSN                                0x1
#define _DAC3CON1_DACR1_POSITION                            0x1
#define _DAC3CON1_DACR1_SIZE                                0x1
#define _DAC3CON1_DACR1_LENGTH                              0x1
#define _DAC3CON1_DACR1_MASK                                0x2
#define _DAC3CON1_DACR2_POSN                                0x2
#define _DAC3CON1_DACR2_POSITION                            0x2
#define _DAC3CON1_DACR2_SIZE                                0x1
#define _DAC3CON1_DACR2_LENGTH                              0x1
#define _DAC3CON1_DACR2_MASK                                0x4
#define _DAC3CON1_DACR3_POSN                                0x3
#define _DAC3CON1_DACR3_POSITION                            0x3
#define _DAC3CON1_DACR3_SIZE                                0x1
#define _DAC3CON1_DACR3_LENGTH                              0x1
#define _DAC3CON1_DACR3_MASK                                0x8
#define _DAC3CON1_DACR4_POSN                                0x4
#define _DAC3CON1_DACR4_POSITION                            0x4
#define _DAC3CON1_DACR4_SIZE                                0x1
#define _DAC3CON1_DACR4_LENGTH                              0x1
#define _DAC3CON1_DACR4_MASK                                0x10
#define _DAC3CON1_R0_POSN                                   0x0
#define _DAC3CON1_R0_POSITION                               0x0
#define _DAC3CON1_R0_SIZE                                   0x1
#define _DAC3CON1_R0_LENGTH                                 0x1
#define _DAC3CON1_R0_MASK                                   0x1
#define _DAC3CON1_R1_POSN                                   0x1
#define _DAC3CON1_R1_POSITION                               0x1
#define _DAC3CON1_R1_SIZE                                   0x1
#define _DAC3CON1_R1_LENGTH                                 0x1
#define _DAC3CON1_R1_MASK                                   0x2
#define _DAC3CON1_R2_POSN                                   0x2
#define _DAC3CON1_R2_POSITION                               0x2
#define _DAC3CON1_R2_SIZE                                   0x1
#define _DAC3CON1_R2_LENGTH                                 0x1
#define _DAC3CON1_R2_MASK                                   0x4
#define _DAC3CON1_R3_POSN                                   0x3
#define _DAC3CON1_R3_POSITION                               0x3
#define _DAC3CON1_R3_SIZE                                   0x1
#define _DAC3CON1_R3_LENGTH                                 0x1
#define _DAC3CON1_R3_MASK                                   0x8
#define _DAC3CON1_R4_POSN                                   0x4
#define _DAC3CON1_R4_POSITION                               0x4
#define _DAC3CON1_R4_SIZE                                   0x1
#define _DAC3CON1_R4_LENGTH                                 0x1
#define _DAC3CON1_R4_MASK                                   0x10
#define _DAC3CON1_DAC3R_POSN                                0x0
#define _DAC3CON1_DAC3R_POSITION                            0x0
#define _DAC3CON1_DAC3R_SIZE                                0x5
#define _DAC3CON1_DAC3R_LENGTH                              0x5
#define _DAC3CON1_DAC3R_MASK                                0x1F
#define _DAC3CON1_DAC3R0_POSN                               0x0
#define _DAC3CON1_DAC3R0_POSITION                           0x0
#define _DAC3CON1_DAC3R0_SIZE                               0x1
#define _DAC3CON1_DAC3R0_LENGTH                             0x1
#define _DAC3CON1_DAC3R0_MASK                               0x1
#define _DAC3CON1_DAC3R1_POSN                               0x1
#define _DAC3CON1_DAC3R1_POSITION                           0x1
#define _DAC3CON1_DAC3R1_SIZE                               0x1
#define _DAC3CON1_DAC3R1_LENGTH                             0x1
#define _DAC3CON1_DAC3R1_MASK                               0x2
#define _DAC3CON1_DAC3R2_POSN                               0x2
#define _DAC3CON1_DAC3R2_POSITION                           0x2
#define _DAC3CON1_DAC3R2_SIZE                               0x1
#define _DAC3CON1_DAC3R2_LENGTH                             0x1
#define _DAC3CON1_DAC3R2_MASK                               0x4
#define _DAC3CON1_DAC3R3_POSN                               0x3
#define _DAC3CON1_DAC3R3_POSITION                           0x3
#define _DAC3CON1_DAC3R3_SIZE                               0x1
#define _DAC3CON1_DAC3R3_LENGTH                             0x1
#define _DAC3CON1_DAC3R3_MASK                               0x8
#define _DAC3CON1_DAC3R4_POSN                               0x4
#define _DAC3CON1_DAC3R4_POSITION                           0x4
#define _DAC3CON1_DAC3R4_SIZE                               0x1
#define _DAC3CON1_DAC3R4_LENGTH                             0x1
#define _DAC3CON1_DAC3R4_MASK                               0x10
#define _DAC3CON1_REF0_POSN                                 0x0
#define _DAC3CON1_REF0_POSITION                             0x0
#define _DAC3CON1_REF0_SIZE                                 0x1
#define _DAC3CON1_REF0_LENGTH                               0x1
#define _DAC3CON1_REF0_MASK                                 0x1
#define _DAC3CON1_REF1_POSN                                 0x1
#define _DAC3CON1_REF1_POSITION                             0x1
#define _DAC3CON1_REF1_SIZE                                 0x1
#define _DAC3CON1_REF1_LENGTH                               0x1
#define _DAC3CON1_REF1_MASK                                 0x2
#define _DAC3CON1_REF2_POSN                                 0x2
#define _DAC3CON1_REF2_POSITION                             0x2
#define _DAC3CON1_REF2_SIZE                                 0x1
#define _DAC3CON1_REF2_LENGTH                               0x1
#define _DAC3CON1_REF2_MASK                                 0x4
#define _DAC3CON1_REF3_POSN                                 0x3
#define _DAC3CON1_REF3_POSITION                             0x3
#define _DAC3CON1_REF3_SIZE                                 0x1
#define _DAC3CON1_REF3_LENGTH                               0x1
#define _DAC3CON1_REF3_MASK                                 0x8
#define _DAC3CON1_REF4_POSN                                 0x4
#define _DAC3CON1_REF4_POSITION                             0x4
#define _DAC3CON1_REF4_SIZE                                 0x1
#define _DAC3CON1_REF4_LENGTH                               0x1
#define _DAC3CON1_REF4_MASK                                 0x10
#define _DAC3CON1_DAC3REF0_POSN                             0x0
#define _DAC3CON1_DAC3REF0_POSITION                         0x0
#define _DAC3CON1_DAC3REF0_SIZE                             0x1
#define _DAC3CON1_DAC3REF0_LENGTH                           0x1
#define _DAC3CON1_DAC3REF0_MASK                             0x1
#define _DAC3CON1_DAC3REF1_POSN                             0x1
#define _DAC3CON1_DAC3REF1_POSITION                         0x1
#define _DAC3CON1_DAC3REF1_SIZE                             0x1
#define _DAC3CON1_DAC3REF1_LENGTH                           0x1
#define _DAC3CON1_DAC3REF1_MASK                             0x2
#define _DAC3CON1_DAC3REF2_POSN                             0x2
#define _DAC3CON1_DAC3REF2_POSITION                         0x2
#define _DAC3CON1_DAC3REF2_SIZE                             0x1
#define _DAC3CON1_DAC3REF2_LENGTH                           0x1
#define _DAC3CON1_DAC3REF2_MASK                             0x4
#define _DAC3CON1_DAC3REF3_POSN                             0x3
#define _DAC3CON1_DAC3REF3_POSITION                         0x3
#define _DAC3CON1_DAC3REF3_SIZE                             0x1
#define _DAC3CON1_DAC3REF3_LENGTH                           0x1
#define _DAC3CON1_DAC3REF3_MASK                             0x8
#define _DAC3CON1_DAC3REF4_POSN                             0x4
#define _DAC3CON1_DAC3REF4_POSITION                         0x4
#define _DAC3CON1_DAC3REF4_SIZE                             0x1
#define _DAC3CON1_DAC3REF4_LENGTH                           0x1
#define _DAC3CON1_DAC3REF4_MASK                             0x10

// Register: DAC4CON0
#define DAC4CON0 DAC4CON0
extern volatile unsigned char           DAC4CON0            __at(0x596);
#ifndef _LIB_BUILD
asm("DAC4CON0 equ 0596h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned                        :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned DACNSS1                :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
    struct {
        unsigned DAC4NSS                :2;
        unsigned DAC4PSS                :2;
        unsigned DAC4OE2                :1;
        unsigned DAC4OE1                :1;
        unsigned                        :1;
        unsigned DAC4EN                 :1;
    };
    struct {
        unsigned DAC4NSS0               :1;
        unsigned DAC4NSS1               :1;
        unsigned DAC4PSS0               :1;
        unsigned DAC4PSS1               :1;
    };
} DAC4CON0bits_t;
