MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
extern volatile DAC5CON1bits_t DAC5CON1bits __at(0x599);
// bitfield macros
#define _DAC5CON1_REF_POSN                                  0x0
#define _DAC5CON1_REF_POSITION                              0x0
#define _DAC5CON1_REF_SIZE                                  0x8
#define _DAC5CON1_REF_LENGTH                                0x8
#define _DAC5CON1_REF_MASK                                  0xFF
#define _DAC5CON1_DAC5REF0_POSN                             0x0
#define _DAC5CON1_DAC5REF0_POSITION                         0x0
#define _DAC5CON1_DAC5REF0_SIZE                             0x1
#define _DAC5CON1_DAC5REF0_LENGTH                           0x1
#define _DAC5CON1_DAC5REF0_MASK                             0x1
#define _DAC5CON1_DAC5REF1_POSN                             0x1
#define _DAC5CON1_DAC5REF1_POSITION                         0x1
#define _DAC5CON1_DAC5REF1_SIZE                             0x1
#define _DAC5CON1_DAC5REF1_LENGTH                           0x1
#define _DAC5CON1_DAC5REF1_MASK                             0x2
#define _DAC5CON1_DAC5REF2_POSN                             0x2
#define _DAC5CON1_DAC5REF2_POSITION                         0x2
#define _DAC5CON1_DAC5REF2_SIZE                             0x1
#define _DAC5CON1_DAC5REF2_LENGTH                           0x1
#define _DAC5CON1_DAC5REF2_MASK                             0x4
#define _DAC5CON1_DAC5REF3_POSN                             0x3
#define _DAC5CON1_DAC5REF3_POSITION                         0x3
#define _DAC5CON1_DAC5REF3_SIZE                             0x1
#define _DAC5CON1_DAC5REF3_LENGTH                           0x1
#define _DAC5CON1_DAC5REF3_MASK                             0x8
#define _DAC5CON1_DAC5REF4_POSN                             0x4
#define _DAC5CON1_DAC5REF4_POSITION                         0x4
#define _DAC5CON1_DAC5REF4_SIZE                             0x1
#define _DAC5CON1_DAC5REF4_LENGTH                           0x1
#define _DAC5CON1_DAC5REF4_MASK                             0x10
#define _DAC5CON1_DAC5REF5_POSN                             0x5
#define _DAC5CON1_DAC5REF5_POSITION                         0x5
#define _DAC5CON1_DAC5REF5_SIZE                             0x1
#define _DAC5CON1_DAC5REF5_LENGTH                           0x1
#define _DAC5CON1_DAC5REF5_MASK                             0x20
#define _DAC5CON1_DAC5REF6_POSN                             0x6
#define _DAC5CON1_DAC5REF6_POSITION                         0x6
#define _DAC5CON1_DAC5REF6_SIZE                             0x1
#define _DAC5CON1_DAC5REF6_LENGTH                           0x1
#define _DAC5CON1_DAC5REF6_MASK                             0x40
#define _DAC5CON1_DAC5REF7_POSN                             0x7
#define _DAC5CON1_DAC5REF7_POSITION                         0x7
#define _DAC5CON1_DAC5REF7_SIZE                             0x1
#define _DAC5CON1_DAC5REF7_LENGTH                           0x1
#define _DAC5CON1_DAC5REF7_MASK                             0x80
#define _DAC5CON1_R0_POSN                                   0x0
#define _DAC5CON1_R0_POSITION                               0x0
#define _DAC5CON1_R0_SIZE                                   0x1
#define _DAC5CON1_R0_LENGTH                                 0x1
#define _DAC5CON1_R0_MASK                                   0x1
#define _DAC5CON1_R1_POSN                                   0x1
#define _DAC5CON1_R1_POSITION                               0x1
#define _DAC5CON1_R1_SIZE                                   0x1
#define _DAC5CON1_R1_LENGTH                                 0x1
#define _DAC5CON1_R1_MASK                                   0x2
#define _DAC5CON1_R2_POSN                                   0x2
#define _DAC5CON1_R2_POSITION                               0x2
#define _DAC5CON1_R2_SIZE                                   0x1
#define _DAC5CON1_R2_LENGTH                                 0x1
#define _DAC5CON1_R2_MASK                                   0x4
#define _DAC5CON1_R3_POSN                                   0x3
#define _DAC5CON1_R3_POSITION                               0x3
#define _DAC5CON1_R3_SIZE                                   0x1
#define _DAC5CON1_R3_LENGTH                                 0x1
#define _DAC5CON1_R3_MASK                                   0x8
#define _DAC5CON1_R4_POSN                                   0x4
#define _DAC5CON1_R4_POSITION                               0x4
#define _DAC5CON1_R4_SIZE                                   0x1
#define _DAC5CON1_R4_LENGTH                                 0x1
#define _DAC5CON1_R4_MASK                                   0x10
#define _DAC5CON1_R5_POSN                                   0x5
#define _DAC5CON1_R5_POSITION                               0x5
#define _DAC5CON1_R5_SIZE                                   0x1
#define _DAC5CON1_R5_LENGTH                                 0x1
#define _DAC5CON1_R5_MASK                                   0x20
#define _DAC5CON1_R6_POSN                                   0x6
#define _DAC5CON1_R6_POSITION                               0x6
#define _DAC5CON1_R6_SIZE                                   0x1
#define _DAC5CON1_R6_LENGTH                                 0x1
#define _DAC5CON1_R6_MASK                                   0x40
#define _DAC5CON1_R7_POSN                                   0x7
#define _DAC5CON1_R7_POSITION                               0x7
#define _DAC5CON1_R7_SIZE                                   0x1
#define _DAC5CON1_R7_LENGTH                                 0x1
#define _DAC5CON1_R7_MASK                                   0x80
#define _DAC5CON1_DAC5R0_POSN                               0x0
#define _DAC5CON1_DAC5R0_POSITION                           0x0
#define _DAC5CON1_DAC5R0_SIZE                               0x1
#define _DAC5CON1_DAC5R0_LENGTH                             0x1
#define _DAC5CON1_DAC5R0_MASK                               0x1
#define _DAC5CON1_DAC5R1_POSN                               0x1
#define _DAC5CON1_DAC5R1_POSITION                           0x1
#define _DAC5CON1_DAC5R1_SIZE                               0x1
#define _DAC5CON1_DAC5R1_LENGTH                             0x1
#define _DAC5CON1_DAC5R1_MASK                               0x2
#define _DAC5CON1_DAC5R2_POSN                               0x2
#define _DAC5CON1_DAC5R2_POSITION                           0x2
#define _DAC5CON1_DAC5R2_SIZE                               0x1
#define _DAC5CON1_DAC5R2_LENGTH                             0x1
#define _DAC5CON1_DAC5R2_MASK                               0x4
#define _DAC5CON1_DAC5R3_POSN                               0x3
#define _DAC5CON1_DAC5R3_POSITION                           0x3
#define _DAC5CON1_DAC5R3_SIZE                               0x1
#define _DAC5CON1_DAC5R3_LENGTH                             0x1
#define _DAC5CON1_DAC5R3_MASK                               0x8
#define _DAC5CON1_DAC5R4_POSN                               0x4
#define _DAC5CON1_DAC5R4_POSITION                           0x4
#define _DAC5CON1_DAC5R4_SIZE                               0x1
#define _DAC5CON1_DAC5R4_LENGTH                             0x1
#define _DAC5CON1_DAC5R4_MASK                               0x10
#define _DAC5CON1_DAC5R5_POSN                               0x5
#define _DAC5CON1_DAC5R5_POSITION                           0x5
#define _DAC5CON1_DAC5R5_SIZE                               0x1
#define _DAC5CON1_DAC5R5_LENGTH                             0x1
#define _DAC5CON1_DAC5R5_MASK                               0x20
#define _DAC5CON1_DAC5R6_POSN                               0x6
#define _DAC5CON1_DAC5R6_POSITION                           0x6
#define _DAC5CON1_DAC5R6_SIZE                               0x1
#define _DAC5CON1_DAC5R6_LENGTH                             0x1
#define _DAC5CON1_DAC5R6_MASK                               0x40
#define _DAC5CON1_DAC5R7_POSN                               0x7
#define _DAC5CON1_DAC5R7_POSITION                           0x7
#define _DAC5CON1_DAC5R7_SIZE                               0x1
#define _DAC5CON1_DAC5R7_LENGTH                             0x1
#define _DAC5CON1_DAC5R7_MASK                               0x80
#define _DAC5CON1_REF0_POSN                                 0x0
#define _DAC5CON1_REF0_POSITION                             0x0
#define _DAC5CON1_REF0_SIZE                                 0x1
#define _DAC5CON1_REF0_LENGTH                               0x1
#define _DAC5CON1_REF0_MASK                                 0x1
#define _DAC5CON1_REF1_POSN                                 0x1
#define _DAC5CON1_REF1_POSITION                             0x1
#define _DAC5CON1_REF1_SIZE                                 0x1
#define _DAC5CON1_REF1_LENGTH                               0x1
#define _DAC5CON1_REF1_MASK                                 0x2
#define _DAC5CON1_REF2_POSN                                 0x2
#define _DAC5CON1_REF2_POSITION                             0x2
#define _DAC5CON1_REF2_SIZE                                 0x1
#define _DAC5CON1_REF2_LENGTH                               0x1
#define _DAC5CON1_REF2_MASK                                 0x4
#define _DAC5CON1_REF3_POSN                                 0x3
#define _DAC5CON1_REF3_POSITION                             0x3
#define _DAC5CON1_REF3_SIZE                                 0x1
#define _DAC5CON1_REF3_LENGTH                               0x1
#define _DAC5CON1_REF3_MASK                                 0x8
#define _DAC5CON1_REF4_POSN                                 0x4
#define _DAC5CON1_REF4_POSITION                             0x4
#define _DAC5CON1_REF4_SIZE                                 0x1
#define _DAC5CON1_REF4_LENGTH                               0x1
#define _DAC5CON1_REF4_MASK                                 0x10
#define _DAC5CON1_REF5_POSN                                 0x5
#define _DAC5CON1_REF5_POSITION                             0x5
#define _DAC5CON1_REF5_SIZE                                 0x1
#define _DAC5CON1_REF5_LENGTH                               0x1
#define _DAC5CON1_REF5_MASK                                 0x20
#define _DAC5CON1_REF6_POSN                                 0x6
#define _DAC5CON1_REF6_POSITION                             0x6
#define _DAC5CON1_REF6_SIZE                                 0x1
#define _DAC5CON1_REF6_LENGTH                               0x1
#define _DAC5CON1_REF6_MASK                                 0x40
#define _DAC5CON1_REF7_POSN                                 0x7
#define _DAC5CON1_REF7_POSITION                             0x7
#define _DAC5CON1_REF7_SIZE                                 0x1
#define _DAC5CON1_REF7_LENGTH                               0x1
#define _DAC5CON1_REF7_MASK                                 0x80

// Register: DAC5REFH
#define DAC5REFH DAC5REFH
extern volatile unsigned char           DAC5REFH            __at(0x59A);
#ifndef _LIB_BUILD
asm("DAC5REFH equ 059Ah");
#endif
// aliases
extern volatile unsigned char           DAC5CON2            __at(0x59A);
#ifndef _LIB_BUILD
asm("DAC5CON2 equ 059Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC5REF8               :1;
        unsigned DAC5REF9               :1;
        unsigned DAC5REF10              :1;
        unsigned DAC5REF11              :1;
        unsigned DAC5REF12              :1;
        unsigned DAC5REF13              :1;
        unsigned DAC5REF14              :1;
        unsigned DAC5REF15              :1;
    };
    struct {
        unsigned R8                     :1;
        unsigned R9                     :1;
        unsigned R10                    :1;
        unsigned R11                    :1;
        unsigned R12                    :1;
        unsigned R13                    :1;
        unsigned R14                    :1;
        unsigned R15                    :1;
    };
    struct {
        unsigned DAC5R8                 :1;
        unsigned DAC5R9                 :1;
        unsigned DAC5R10                :1;
        unsigned DAC5R11                :1;
        unsigned DAC5R12                :1;
        unsigned DAC5R13                :1;
        unsigned DAC5R14                :1;
        unsigned DAC5R15                :1;
    };
    struct {
        unsigned REF8                   :1;
        unsigned REF9                   :1;
        unsigned REF10                  :1;
        unsigned REF11                  :1;
        unsigned REF12                  :1;
        unsigned REF13                  :1;
        unsigned REF14                  :1;
        unsigned REF15                  :1;
    };
} DAC5REFHbits_t;
