MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
// Register: COG1ASD0
#define COG1ASD0 COG1ASD0
extern volatile unsigned char           COG1ASD0            __at(0x69D);
#ifndef _LIB_BUILD
asm("COG1ASD0 equ 069Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ASDAC                  :2;
        unsigned ASDBD                  :2;
        unsigned ASREN                  :1;
        unsigned ASE                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned ASDAC0                 :1;
        unsigned ASDAC1                 :1;
        unsigned ASDBD0                 :1;
        unsigned ASDBD1                 :1;
        unsigned ARSEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G1ASDAC                :2;
        unsigned G1ASDBD                :2;
        unsigned G1ARSEN                :1;
        unsigned G1ASE                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G1ASDAC0               :1;
        unsigned G1ASDAC1               :1;
        unsigned G1ASDBD0               :1;
        unsigned G1ASDBD1               :1;
        unsigned G1ASREN                :1;
    };
} COG1ASD0bits_t;
extern volatile COG1ASD0bits_t COG1ASD0bits __at(0x69D);
// bitfield macros
#define _COG1ASD0_ASDAC_POSN                                0x2
#define _COG1ASD0_ASDAC_POSITION                            0x2
#define _COG1ASD0_ASDAC_SIZE                                0x2
#define _COG1ASD0_ASDAC_LENGTH                              0x2
#define _COG1ASD0_ASDAC_MASK                                0xC
#define _COG1ASD0_ASDBD_POSN                                0x4
#define _COG1ASD0_ASDBD_POSITION                            0x4
#define _COG1ASD0_ASDBD_SIZE                                0x2
#define _COG1ASD0_ASDBD_LENGTH                              0x2
#define _COG1ASD0_ASDBD_MASK                                0x30
#define _COG1ASD0_ASREN_POSN                                0x6
#define _COG1ASD0_ASREN_POSITION                            0x6
#define _COG1ASD0_ASREN_SIZE                                0x1
#define _COG1ASD0_ASREN_LENGTH                              0x1
#define _COG1ASD0_ASREN_MASK                                0x40
#define _COG1ASD0_ASE_POSN                                  0x7
#define _COG1ASD0_ASE_POSITION                              0x7
#define _COG1ASD0_ASE_SIZE                                  0x1
#define _COG1ASD0_ASE_LENGTH                                0x1
#define _COG1ASD0_ASE_MASK                                  0x80
#define _COG1ASD0_ASDAC0_POSN                               0x2
#define _COG1ASD0_ASDAC0_POSITION                           0x2
#define _COG1ASD0_ASDAC0_SIZE                               0x1
#define _COG1ASD0_ASDAC0_LENGTH                             0x1
#define _COG1ASD0_ASDAC0_MASK                               0x4
#define _COG1ASD0_ASDAC1_POSN                               0x3
#define _COG1ASD0_ASDAC1_POSITION                           0x3
#define _COG1ASD0_ASDAC1_SIZE                               0x1
#define _COG1ASD0_ASDAC1_LENGTH                             0x1
#define _COG1ASD0_ASDAC1_MASK                               0x8
#define _COG1ASD0_ASDBD0_POSN                               0x4
#define _COG1ASD0_ASDBD0_POSITION                           0x4
#define _COG1ASD0_ASDBD0_SIZE                               0x1
#define _COG1ASD0_ASDBD0_LENGTH                             0x1
#define _COG1ASD0_ASDBD0_MASK                               0x10
#define _COG1ASD0_ASDBD1_POSN                               0x5
#define _COG1ASD0_ASDBD1_POSITION                           0x5
#define _COG1ASD0_ASDBD1_SIZE                               0x1
#define _COG1ASD0_ASDBD1_LENGTH                             0x1
#define _COG1ASD0_ASDBD1_MASK                               0x20
#define _COG1ASD0_ARSEN_POSN                                0x6
#define _COG1ASD0_ARSEN_POSITION                            0x6
#define _COG1ASD0_ARSEN_SIZE                                0x1
#define _COG1ASD0_ARSEN_LENGTH                              0x1
#define _COG1ASD0_ARSEN_MASK                                0x40
#define _COG1ASD0_G1ASDAC_POSN                              0x2
#define _COG1ASD0_G1ASDAC_POSITION                          0x2
#define _COG1ASD0_G1ASDAC_SIZE                              0x2
#define _COG1ASD0_G1ASDAC_LENGTH                            0x2
#define _COG1ASD0_G1ASDAC_MASK                              0xC
#define _COG1ASD0_G1ASDBD_POSN                              0x4
#define _COG1ASD0_G1ASDBD_POSITION                          0x4
#define _COG1ASD0_G1ASDBD_SIZE                              0x2
#define _COG1ASD0_G1ASDBD_LENGTH                            0x2
#define _COG1ASD0_G1ASDBD_MASK                              0x30
#define _COG1ASD0_G1ARSEN_POSN                              0x6
#define _COG1ASD0_G1ARSEN_POSITION                          0x6
#define _COG1ASD0_G1ARSEN_SIZE                              0x1
#define _COG1ASD0_G1ARSEN_LENGTH                            0x1
#define _COG1ASD0_G1ARSEN_MASK                              0x40
#define _COG1ASD0_G1ASE_POSN                                0x7
#define _COG1ASD0_G1ASE_POSITION                            0x7
#define _COG1ASD0_G1ASE_SIZE                                0x1
#define _COG1ASD0_G1ASE_LENGTH                              0x1
#define _COG1ASD0_G1ASE_MASK                                0x80
#define _COG1ASD0_G1ASDAC0_POSN                             0x2
#define _COG1ASD0_G1ASDAC0_POSITION                         0x2
#define _COG1ASD0_G1ASDAC0_SIZE                             0x1
#define _COG1ASD0_G1ASDAC0_LENGTH                           0x1
#define _COG1ASD0_G1ASDAC0_MASK                             0x4
#define _COG1ASD0_G1ASDAC1_POSN                             0x3
#define _COG1ASD0_G1ASDAC1_POSITION                         0x3
#define _COG1ASD0_G1ASDAC1_SIZE                             0x1
#define _COG1ASD0_G1ASDAC1_LENGTH                           0x1
#define _COG1ASD0_G1ASDAC1_MASK                             0x8
#define _COG1ASD0_G1ASDBD0_POSN                             0x4
#define _COG1ASD0_G1ASDBD0_POSITION                         0x4
#define _COG1ASD0_G1ASDBD0_SIZE                             0x1
#define _COG1ASD0_G1ASDBD0_LENGTH                           0x1
#define _COG1ASD0_G1ASDBD0_MASK                             0x10
#define _COG1ASD0_G1ASDBD1_POSN                             0x5
#define _COG1ASD0_G1ASDBD1_POSITION                         0x5
#define _COG1ASD0_G1ASDBD1_SIZE                             0x1
#define _COG1ASD0_G1ASDBD1_LENGTH                           0x1
#define _COG1ASD0_G1ASDBD1_MASK                             0x20
#define _COG1ASD0_G1ASREN_POSN                              0x6
#define _COG1ASD0_G1ASREN_POSITION                          0x6
#define _COG1ASD0_G1ASREN_SIZE                              0x1
#define _COG1ASD0_G1ASREN_LENGTH                            0x1
#define _COG1ASD0_G1ASREN_MASK                              0x40

// Register: COG1ASD1
#define COG1ASD1 COG1ASD1
extern volatile unsigned char           COG1ASD1            __at(0x69E);
#ifndef _LIB_BUILD
asm("COG1ASD1 equ 069Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
        unsigned AS7E                   :1;
    };
    struct {
        unsigned G1AS0E                 :1;
        unsigned G1AS1E                 :1;
        unsigned G1AS2E                 :1;
        unsigned G1AS3E                 :1;
        unsigned G1AS4E                 :1;
        unsigned G1AS5E                 :1;
        unsigned G1AS6E                 :1;
        unsigned G1AS7E                 :1;
    };
} COG1ASD1bits_t;
