MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
extern volatile COG3FIS1bits_t COG3FIS1bits __at(0x81A);
// bitfield macros
#define _COG3FIS1_FIS9_POSN                                 0x1
#define _COG3FIS1_FIS9_POSITION                             0x1
#define _COG3FIS1_FIS9_SIZE                                 0x1
#define _COG3FIS1_FIS9_LENGTH                               0x1
#define _COG3FIS1_FIS9_MASK                                 0x2
#define _COG3FIS1_FIS11_POSN                                0x3
#define _COG3FIS1_FIS11_POSITION                            0x3
#define _COG3FIS1_FIS11_SIZE                                0x1
#define _COG3FIS1_FIS11_LENGTH                              0x1
#define _COG3FIS1_FIS11_MASK                                0x8
#define _COG3FIS1_FIS12_POSN                                0x4
#define _COG3FIS1_FIS12_POSITION                            0x4
#define _COG3FIS1_FIS12_SIZE                                0x1
#define _COG3FIS1_FIS12_LENGTH                              0x1
#define _COG3FIS1_FIS12_MASK                                0x10
#define _COG3FIS1_FIS13_POSN                                0x5
#define _COG3FIS1_FIS13_POSITION                            0x5
#define _COG3FIS1_FIS13_SIZE                                0x1
#define _COG3FIS1_FIS13_LENGTH                              0x1
#define _COG3FIS1_FIS13_MASK                                0x20
#define _COG3FIS1_FIS14_POSN                                0x6
#define _COG3FIS1_FIS14_POSITION                            0x6
#define _COG3FIS1_FIS14_SIZE                                0x1
#define _COG3FIS1_FIS14_LENGTH                              0x1
#define _COG3FIS1_FIS14_MASK                                0x40
#define _COG3FIS1_FIS15_POSN                                0x7
#define _COG3FIS1_FIS15_POSITION                            0x7
#define _COG3FIS1_FIS15_SIZE                                0x1
#define _COG3FIS1_FIS15_LENGTH                              0x1
#define _COG3FIS1_FIS15_MASK                                0x80
#define _COG3FIS1_G3FIS9_POSN                               0x1
#define _COG3FIS1_G3FIS9_POSITION                           0x1
#define _COG3FIS1_G3FIS9_SIZE                               0x1
#define _COG3FIS1_G3FIS9_LENGTH                             0x1
#define _COG3FIS1_G3FIS9_MASK                               0x2
#define _COG3FIS1_G3FIS11_POSN                              0x3
#define _COG3FIS1_G3FIS11_POSITION                          0x3
#define _COG3FIS1_G3FIS11_SIZE                              0x1
#define _COG3FIS1_G3FIS11_LENGTH                            0x1
#define _COG3FIS1_G3FIS11_MASK                              0x8
#define _COG3FIS1_G3FIS12_POSN                              0x4
#define _COG3FIS1_G3FIS12_POSITION                          0x4
#define _COG3FIS1_G3FIS12_SIZE                              0x1
#define _COG3FIS1_G3FIS12_LENGTH                            0x1
#define _COG3FIS1_G3FIS12_MASK                              0x10
#define _COG3FIS1_G3FIS13_POSN                              0x5
#define _COG3FIS1_G3FIS13_POSITION                          0x5
#define _COG3FIS1_G3FIS13_SIZE                              0x1
#define _COG3FIS1_G3FIS13_LENGTH                            0x1
#define _COG3FIS1_G3FIS13_MASK                              0x20
#define _COG3FIS1_G3FIS14_POSN                              0x6
#define _COG3FIS1_G3FIS14_POSITION                          0x6
#define _COG3FIS1_G3FIS14_SIZE                              0x1
#define _COG3FIS1_G3FIS14_LENGTH                            0x1
#define _COG3FIS1_G3FIS14_MASK                              0x40
#define _COG3FIS1_G3FIS15_POSN                              0x7
#define _COG3FIS1_G3FIS15_POSITION                          0x7
#define _COG3FIS1_G3FIS15_SIZE                              0x1
#define _COG3FIS1_G3FIS15_LENGTH                            0x1
#define _COG3FIS1_G3FIS15_MASK                              0x80

// Register: COG3FSIM0
#define COG3FSIM0 COG3FSIM0
extern volatile unsigned char           COG3FSIM0           __at(0x81B);
#ifndef _LIB_BUILD
asm("COG3FSIM0 equ 081Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSIM0                  :1;
        unsigned FSIM1                  :1;
        unsigned FSIM2                  :1;
        unsigned FSIM3                  :1;
        unsigned FSIM4                  :1;
        unsigned FSIM5                  :1;
        unsigned FSIM6                  :1;
        unsigned FSIM7                  :1;
    };
    struct {
        unsigned G3FSIM0                :1;
        unsigned G3FSIM1                :1;
        unsigned G3FSIM2                :1;
        unsigned G3FSIM3                :1;
        unsigned G3FSIM4                :1;
        unsigned G3FSIM5                :1;
        unsigned G3FSIM6                :1;
        unsigned G3FSIM7                :1;
    };
} COG3FSIM0bits_t;
extern volatile COG3FSIM0bits_t COG3FSIM0bits __at(0x81B);
// bitfield macros
#define _COG3FSIM0_FSIM0_POSN                               0x0
#define _COG3FSIM0_FSIM0_POSITION                           0x0
#define _COG3FSIM0_FSIM0_SIZE                               0x1
#define _COG3FSIM0_FSIM0_LENGTH                             0x1
#define _COG3FSIM0_FSIM0_MASK                               0x1
#define _COG3FSIM0_FSIM1_POSN                               0x1
#define _COG3FSIM0_FSIM1_POSITION                           0x1
#define _COG3FSIM0_FSIM1_SIZE                               0x1
#define _COG3FSIM0_FSIM1_LENGTH                             0x1
#define _COG3FSIM0_FSIM1_MASK                               0x2
#define _COG3FSIM0_FSIM2_POSN                               0x2
#define _COG3FSIM0_FSIM2_POSITION                           0x2
#define _COG3FSIM0_FSIM2_SIZE                               0x1
#define _COG3FSIM0_FSIM2_LENGTH                             0x1
#define _COG3FSIM0_FSIM2_MASK                               0x4
#define _COG3FSIM0_FSIM3_POSN                               0x3
#define _COG3FSIM0_FSIM3_POSITION                           0x3
#define _COG3FSIM0_FSIM3_SIZE                               0x1
#define _COG3FSIM0_FSIM3_LENGTH                             0x1
#define _COG3FSIM0_FSIM3_MASK                               0x8
#define _COG3FSIM0_FSIM4_POSN                               0x4
#define _COG3FSIM0_FSIM4_POSITION                           0x4
#define _COG3FSIM0_FSIM4_SIZE                               0x1
#define _COG3FSIM0_FSIM4_LENGTH                             0x1
#define _COG3FSIM0_FSIM4_MASK                               0x10
#define _COG3FSIM0_FSIM5_POSN                               0x5
#define _COG3FSIM0_FSIM5_POSITION                           0x5
#define _COG3FSIM0_FSIM5_SIZE                               0x1
#define _COG3FSIM0_FSIM5_LENGTH                             0x1
#define _COG3FSIM0_FSIM5_MASK                               0x20
#define _COG3FSIM0_FSIM6_POSN                               0x6
#define _COG3FSIM0_FSIM6_POSITION                           0x6
#define _COG3FSIM0_FSIM6_SIZE                               0x1
#define _COG3FSIM0_FSIM6_LENGTH                             0x1
#define _COG3FSIM0_FSIM6_MASK                               0x40
#define _COG3FSIM0_FSIM7_POSN                               0x7
#define _COG3FSIM0_FSIM7_POSITION                           0x7
#define _COG3FSIM0_FSIM7_SIZE                               0x1
#define _COG3FSIM0_FSIM7_LENGTH                             0x1
#define _COG3FSIM0_FSIM7_MASK                               0x80
#define _COG3FSIM0_G3FSIM0_POSN                             0x0
#define _COG3FSIM0_G3FSIM0_POSITION                         0x0
#define _COG3FSIM0_G3FSIM0_SIZE                             0x1
#define _COG3FSIM0_G3FSIM0_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM0_MASK                             0x1
#define _COG3FSIM0_G3FSIM1_POSN                             0x1
#define _COG3FSIM0_G3FSIM1_POSITION                         0x1
#define _COG3FSIM0_G3FSIM1_SIZE                             0x1
#define _COG3FSIM0_G3FSIM1_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM1_MASK                             0x2
#define _COG3FSIM0_G3FSIM2_POSN                             0x2
#define _COG3FSIM0_G3FSIM2_POSITION                         0x2
#define _COG3FSIM0_G3FSIM2_SIZE                             0x1
#define _COG3FSIM0_G3FSIM2_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM2_MASK                             0x4
#define _COG3FSIM0_G3FSIM3_POSN                             0x3
#define _COG3FSIM0_G3FSIM3_POSITION                         0x3
#define _COG3FSIM0_G3FSIM3_SIZE                             0x1
#define _COG3FSIM0_G3FSIM3_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM3_MASK                             0x8
#define _COG3FSIM0_G3FSIM4_POSN                             0x4
#define _COG3FSIM0_G3FSIM4_POSITION                         0x4
#define _COG3FSIM0_G3FSIM4_SIZE                             0x1
#define _COG3FSIM0_G3FSIM4_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM4_MASK                             0x10
#define _COG3FSIM0_G3FSIM5_POSN                             0x5
#define _COG3FSIM0_G3FSIM5_POSITION                         0x5
#define _COG3FSIM0_G3FSIM5_SIZE                             0x1
#define _COG3FSIM0_G3FSIM5_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM5_MASK                             0x20
#define _COG3FSIM0_G3FSIM6_POSN                             0x6
#define _COG3FSIM0_G3FSIM6_POSITION                         0x6
#define _COG3FSIM0_G3FSIM6_SIZE                             0x1
#define _COG3FSIM0_G3FSIM6_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM6_MASK                             0x40
#define _COG3FSIM0_G3FSIM7_POSN                             0x7
#define _COG3FSIM0_G3FSIM7_POSITION                         0x7
#define _COG3FSIM0_G3FSIM7_SIZE                             0x1
#define _COG3FSIM0_G3FSIM7_LENGTH                           0x1
#define _COG3FSIM0_G3FSIM7_MASK                             0x80

