MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
extern volatile CM6PSELbits_t CM6PSELbits __at(0x917);
// bitfield macros
#define _CM6PSEL_PCH_POSN                                   0x0
#define _CM6PSEL_PCH_POSITION                               0x0
#define _CM6PSEL_PCH_SIZE                                   0x4
#define _CM6PSEL_PCH_LENGTH                                 0x4
#define _CM6PSEL_PCH_MASK                                   0xF
#define _CM6PSEL_PCH0_POSN                                  0x0
#define _CM6PSEL_PCH0_POSITION                              0x0
#define _CM6PSEL_PCH0_SIZE                                  0x1
#define _CM6PSEL_PCH0_LENGTH                                0x1
#define _CM6PSEL_PCH0_MASK                                  0x1
#define _CM6PSEL_PCH1_POSN                                  0x1
#define _CM6PSEL_PCH1_POSITION                              0x1
#define _CM6PSEL_PCH1_SIZE                                  0x1
#define _CM6PSEL_PCH1_LENGTH                                0x1
#define _CM6PSEL_PCH1_MASK                                  0x2
#define _CM6PSEL_PCH2_POSN                                  0x2
#define _CM6PSEL_PCH2_POSITION                              0x2
#define _CM6PSEL_PCH2_SIZE                                  0x1
#define _CM6PSEL_PCH2_LENGTH                                0x1
#define _CM6PSEL_PCH2_MASK                                  0x4
#define _CM6PSEL_PCH3_POSN                                  0x3
#define _CM6PSEL_PCH3_POSITION                              0x3
#define _CM6PSEL_PCH3_SIZE                                  0x1
#define _CM6PSEL_PCH3_LENGTH                                0x1
#define _CM6PSEL_PCH3_MASK                                  0x8
#define _CM6PSEL_C6PCH_POSN                                 0x0
#define _CM6PSEL_C6PCH_POSITION                             0x0
#define _CM6PSEL_C6PCH_SIZE                                 0x4
#define _CM6PSEL_C6PCH_LENGTH                               0x4
#define _CM6PSEL_C6PCH_MASK                                 0xF
#define _CM6PSEL_C6PCH0_POSN                                0x0
#define _CM6PSEL_C6PCH0_POSITION                            0x0
#define _CM6PSEL_C6PCH0_SIZE                                0x1
#define _CM6PSEL_C6PCH0_LENGTH                              0x1
#define _CM6PSEL_C6PCH0_MASK                                0x1
#define _CM6PSEL_C6PCH1_POSN                                0x1
#define _CM6PSEL_C6PCH1_POSITION                            0x1
#define _CM6PSEL_C6PCH1_SIZE                                0x1
#define _CM6PSEL_C6PCH1_LENGTH                              0x1
#define _CM6PSEL_C6PCH1_MASK                                0x2
#define _CM6PSEL_C6PCH2_POSN                                0x2
#define _CM6PSEL_C6PCH2_POSITION                            0x2
#define _CM6PSEL_C6PCH2_SIZE                                0x1
#define _CM6PSEL_C6PCH2_LENGTH                              0x1
#define _CM6PSEL_C6PCH2_MASK                                0x4
#define _CM6PSEL_C6PCH3_POSN                                0x3
#define _CM6PSEL_C6PCH3_POSITION                            0x3
#define _CM6PSEL_C6PCH3_SIZE                                0x1
#define _CM6PSEL_C6PCH3_LENGTH                              0x1
#define _CM6PSEL_C6PCH3_MASK                                0x8

// Register: PWMEN
#define PWMEN PWMEN
extern volatile unsigned char           PWMEN               __at(0xD8E);
#ifndef _LIB_BUILD
asm("PWMEN equ 0D8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM5EN                :1;
        unsigned MPWM6EN                :1;
        unsigned MPWM11EN               :1;
    };
} PWMENbits_t;
extern volatile PWMENbits_t PWMENbits __at(0xD8E);
// bitfield macros
#define _PWMEN_MPWM5EN_POSN                                 0x0
#define _PWMEN_MPWM5EN_POSITION                             0x0
#define _PWMEN_MPWM5EN_SIZE                                 0x1
#define _PWMEN_MPWM5EN_LENGTH                               0x1
#define _PWMEN_MPWM5EN_MASK                                 0x1
#define _PWMEN_MPWM6EN_POSN                                 0x1
#define _PWMEN_MPWM6EN_POSITION                             0x1
#define _PWMEN_MPWM6EN_SIZE                                 0x1
#define _PWMEN_MPWM6EN_LENGTH                               0x1
#define _PWMEN_MPWM6EN_MASK                                 0x2
#define _PWMEN_MPWM11EN_POSN                                0x2
#define _PWMEN_MPWM11EN_POSITION                            0x2
#define _PWMEN_MPWM11EN_SIZE                                0x1
#define _PWMEN_MPWM11EN_LENGTH                              0x1
#define _PWMEN_MPWM11EN_MASK                                0x4

// Register: PWMLD
#define PWMLD PWMLD
extern volatile unsigned char           PWMLD               __at(0xD8F);
#ifndef _LIB_BUILD
asm("PWMLD equ 0D8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM5LD                :1;
        unsigned MPWM6LD                :1;
        unsigned MPWM11LD               :1;
    };
} PWMLDbits_t;
extern volatile PWMLDbits_t PWMLDbits __at(0xD8F);
// bitfield macros
#define _PWMLD_MPWM5LD_POSN                                 0x0
#define _PWMLD_MPWM5LD_POSITION                             0x0
#define _PWMLD_MPWM5LD_SIZE                                 0x1
#define _PWMLD_MPWM5LD_LENGTH                               0x1
#define _PWMLD_MPWM5LD_MASK                                 0x1
#define _PWMLD_MPWM6LD_POSN                                 0x1
#define _PWMLD_MPWM6LD_POSITION                             0x1
#define _PWMLD_MPWM6LD_SIZE                                 0x1
#define _PWMLD_MPWM6LD_LENGTH                               0x1
#define _PWMLD_MPWM6LD_MASK                                 0x2
#define _PWMLD_MPWM11LD_POSN                                0x2
#define _PWMLD_MPWM11LD_POSITION                            0x2
#define _PWMLD_MPWM11LD_SIZE                                0x1
#define _PWMLD_MPWM11LD_LENGTH                              0x1
#define _PWMLD_MPWM11LD_MASK                                0x4

// Register: PWMOUT
#define PWMOUT PWMOUT
extern volatile unsigned char           PWMOUT              __at(0xD90);
#ifndef _LIB_BUILD
asm("PWMOUT equ 0D90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM5OUT               :1;
        unsigned MPWM6OUT               :1;
        unsigned MPWM11OUT              :1;
    };
} PWMOUTbits_t;
extern volatile PWMOUTbits_t PWMOUTbits __at(0xD90);
// bitfield macros
#define _PWMOUT_MPWM5OUT_POSN                               0x0
#define _PWMOUT_MPWM5OUT_POSITION                           0x0
#define _PWMOUT_MPWM5OUT_SIZE                               0x1
#define _PWMOUT_MPWM5OUT_LENGTH                             0x1
#define _PWMOUT_MPWM5OUT_MASK                               0x1
#define _PWMOUT_MPWM6OUT_POSN                               0x1
#define _PWMOUT_MPWM6OUT_POSITION                           0x1
#define _PWMOUT_MPWM6OUT_SIZE                               0x1
#define _PWMOUT_MPWM6OUT_LENGTH                             0x1
#define _PWMOUT_MPWM6OUT_MASK                               0x2
#define _PWMOUT_MPWM11OUT_POSN                              0x2
#define _PWMOUT_MPWM11OUT_POSITION                          0x2
#define _PWMOUT_MPWM11OUT_SIZE                              0x1
#define _PWMOUT_MPWM11OUT_LENGTH                            0x1
#define _PWMOUT_MPWM11OUT_MASK                              0x4

// Register: PWM5PH
#define PWM5PH PWM5PH
extern volatile unsigned short          PWM5PH              __at(0xD91);
#ifndef _LIB_BUILD
asm("PWM5PH equ 0D91h");
#endif

// Register: PWM5PHL
#define PWM5PHL PWM5PHL
extern volatile unsigned char           PWM5PHL             __at(0xD91);
#ifndef _LIB_BUILD
asm("PWM5PHL equ 0D91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM5PHL0               :1;
        unsigned PWM5PHL1               :1;
        unsigned PWM5PHL2               :1;
        unsigned PWM5PHL3               :1;
        unsigned PWM5PHL4               :1;
        unsigned PWM5PHL5               :1;
        unsigned PWM5PHL6               :1;
        unsigned PWM5PHL7               :1;
    };
    struct {
        unsigned PWM5PHL                :8;
    };
} PWM5PHLbits_t;
