MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
extern volatile PWM11OFLbits_t PWM11OFLbits __at(0xDB7);
// bitfield macros
#define _PWM11OFL_OF_POSN                                   0x0
#define _PWM11OFL_OF_POSITION                               0x0
#define _PWM11OFL_OF_SIZE                                   0x8
#define _PWM11OFL_OF_LENGTH                                 0x8
#define _PWM11OFL_OF_MASK                                   0xFF
#define _PWM11OFL_PWM11OFL0_POSN                            0x0
#define _PWM11OFL_PWM11OFL0_POSITION                        0x0
#define _PWM11OFL_PWM11OFL0_SIZE                            0x1
#define _PWM11OFL_PWM11OFL0_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL0_MASK                            0x1
#define _PWM11OFL_PWM11OFL1_POSN                            0x1
#define _PWM11OFL_PWM11OFL1_POSITION                        0x1
#define _PWM11OFL_PWM11OFL1_SIZE                            0x1
#define _PWM11OFL_PWM11OFL1_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL1_MASK                            0x2
#define _PWM11OFL_PWM11OFL2_POSN                            0x2
#define _PWM11OFL_PWM11OFL2_POSITION                        0x2
#define _PWM11OFL_PWM11OFL2_SIZE                            0x1
#define _PWM11OFL_PWM11OFL2_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL2_MASK                            0x4
#define _PWM11OFL_PWM11OFL3_POSN                            0x3
#define _PWM11OFL_PWM11OFL3_POSITION                        0x3
#define _PWM11OFL_PWM11OFL3_SIZE                            0x1
#define _PWM11OFL_PWM11OFL3_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL3_MASK                            0x8
#define _PWM11OFL_PWM11OFL4_POSN                            0x4
#define _PWM11OFL_PWM11OFL4_POSITION                        0x4
#define _PWM11OFL_PWM11OFL4_SIZE                            0x1
#define _PWM11OFL_PWM11OFL4_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL4_MASK                            0x10
#define _PWM11OFL_PWM11OFL5_POSN                            0x5
#define _PWM11OFL_PWM11OFL5_POSITION                        0x5
#define _PWM11OFL_PWM11OFL5_SIZE                            0x1
#define _PWM11OFL_PWM11OFL5_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL5_MASK                            0x20
#define _PWM11OFL_PWM11OFL6_POSN                            0x6
#define _PWM11OFL_PWM11OFL6_POSITION                        0x6
#define _PWM11OFL_PWM11OFL6_SIZE                            0x1
#define _PWM11OFL_PWM11OFL6_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL6_MASK                            0x40
#define _PWM11OFL_PWM11OFL7_POSN                            0x7
#define _PWM11OFL_PWM11OFL7_POSITION                        0x7
#define _PWM11OFL_PWM11OFL7_SIZE                            0x1
#define _PWM11OFL_PWM11OFL7_LENGTH                          0x1
#define _PWM11OFL_PWM11OFL7_MASK                            0x80
#define _PWM11OFL_PWM11OFL_POSN                             0x0
#define _PWM11OFL_PWM11OFL_POSITION                         0x0
#define _PWM11OFL_PWM11OFL_SIZE                             0x8
#define _PWM11OFL_PWM11OFL_LENGTH                           0x8
#define _PWM11OFL_PWM11OFL_MASK                             0xFF

// Register: PWM11OFH
#define PWM11OFH PWM11OFH
extern volatile unsigned char           PWM11OFH            __at(0xDB8);
#ifndef _LIB_BUILD
asm("PWM11OFH equ 0DB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM11OFH0              :1;
        unsigned PWM11OFH1              :1;
        unsigned PWM11OFH2              :1;
        unsigned PWM11OFH3              :1;
        unsigned PWM11OFH4              :1;
        unsigned PWM11OFH5              :1;
        unsigned PWM11OFH6              :1;
        unsigned PWM11OFH7              :1;
    };
    struct {
        unsigned PWM11OFH               :8;
    };
} PWM11OFHbits_t;
extern volatile PWM11OFHbits_t PWM11OFHbits __at(0xDB8);
// bitfield macros
#define _PWM11OFH_OF_POSN                                   0x0
#define _PWM11OFH_OF_POSITION                               0x0
#define _PWM11OFH_OF_SIZE                                   0x8
#define _PWM11OFH_OF_LENGTH                                 0x8
#define _PWM11OFH_OF_MASK                                   0xFF
#define _PWM11OFH_PWM11OFH0_POSN                            0x0
#define _PWM11OFH_PWM11OFH0_POSITION                        0x0
#define _PWM11OFH_PWM11OFH0_SIZE                            0x1
#define _PWM11OFH_PWM11OFH0_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH0_MASK                            0x1
#define _PWM11OFH_PWM11OFH1_POSN                            0x1
#define _PWM11OFH_PWM11OFH1_POSITION                        0x1
#define _PWM11OFH_PWM11OFH1_SIZE                            0x1
#define _PWM11OFH_PWM11OFH1_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH1_MASK                            0x2
#define _PWM11OFH_PWM11OFH2_POSN                            0x2
#define _PWM11OFH_PWM11OFH2_POSITION                        0x2
#define _PWM11OFH_PWM11OFH2_SIZE                            0x1
#define _PWM11OFH_PWM11OFH2_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH2_MASK                            0x4
#define _PWM11OFH_PWM11OFH3_POSN                            0x3
#define _PWM11OFH_PWM11OFH3_POSITION                        0x3
#define _PWM11OFH_PWM11OFH3_SIZE                            0x1
#define _PWM11OFH_PWM11OFH3_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH3_MASK                            0x8
#define _PWM11OFH_PWM11OFH4_POSN                            0x4
#define _PWM11OFH_PWM11OFH4_POSITION                        0x4
#define _PWM11OFH_PWM11OFH4_SIZE                            0x1
#define _PWM11OFH_PWM11OFH4_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH4_MASK                            0x10
#define _PWM11OFH_PWM11OFH5_POSN                            0x5
#define _PWM11OFH_PWM11OFH5_POSITION                        0x5
#define _PWM11OFH_PWM11OFH5_SIZE                            0x1
#define _PWM11OFH_PWM11OFH5_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH5_MASK                            0x20
#define _PWM11OFH_PWM11OFH6_POSN                            0x6
#define _PWM11OFH_PWM11OFH6_POSITION                        0x6
#define _PWM11OFH_PWM11OFH6_SIZE                            0x1
#define _PWM11OFH_PWM11OFH6_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH6_MASK                            0x40
#define _PWM11OFH_PWM11OFH7_POSN                            0x7
#define _PWM11OFH_PWM11OFH7_POSITION                        0x7
#define _PWM11OFH_PWM11OFH7_SIZE                            0x1
#define _PWM11OFH_PWM11OFH7_LENGTH                          0x1
#define _PWM11OFH_PWM11OFH7_MASK                            0x80
#define _PWM11OFH_PWM11OFH_POSN                             0x0
#define _PWM11OFH_PWM11OFH_POSITION                         0x0
#define _PWM11OFH_PWM11OFH_SIZE                             0x8
#define _PWM11OFH_PWM11OFH_LENGTH                           0x8
#define _PWM11OFH_PWM11OFH_MASK                             0xFF

// Register: PWM11TMR
#define PWM11TMR PWM11TMR
extern volatile unsigned short          PWM11TMR            __at(0xDB9);
#ifndef _LIB_BUILD
asm("PWM11TMR equ 0DB9h");
#endif

// Register: PWM11TMRL
#define PWM11TMRL PWM11TMRL
extern volatile unsigned char           PWM11TMRL           __at(0xDB9);
#ifndef _LIB_BUILD
asm("PWM11TMRL equ 0DB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM11TMRL0             :1;
        unsigned PWM11TMRL1             :1;
        unsigned PWM11TMRL2             :1;
        unsigned PWM11TMRL3             :1;
        unsigned PWM11TMRL4             :1;
        unsigned PWM11TMRL5             :1;
        unsigned PWM11TMRL6             :1;
        unsigned PWM11TMRL7             :1;
    };
    struct {
        unsigned PWM11TMRL              :8;
    };
} PWM11TMRLbits_t;
extern volatile PWM11TMRLbits_t PWM11TMRLbits __at(0xDB9);
// bitfield macros
#define _PWM11TMRL_TMR_POSN                                 0x0
#define _PWM11TMRL_TMR_POSITION                             0x0
#define _PWM11TMRL_TMR_SIZE                                 0x8
#define _PWM11TMRL_TMR_LENGTH                               0x8
#define _PWM11TMRL_TMR_MASK                                 0xFF
#define _PWM11TMRL_PWM11TMRL0_POSN                          0x0
#define _PWM11TMRL_PWM11TMRL0_POSITION                      0x0
#define _PWM11TMRL_PWM11TMRL0_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL0_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL0_MASK                          0x1
#define _PWM11TMRL_PWM11TMRL1_POSN                          0x1
#define _PWM11TMRL_PWM11TMRL1_POSITION                      0x1
#define _PWM11TMRL_PWM11TMRL1_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL1_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL1_MASK                          0x2
#define _PWM11TMRL_PWM11TMRL2_POSN                          0x2
#define _PWM11TMRL_PWM11TMRL2_POSITION                      0x2
#define _PWM11TMRL_PWM11TMRL2_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL2_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL2_MASK                          0x4
#define _PWM11TMRL_PWM11TMRL3_POSN                          0x3
#define _PWM11TMRL_PWM11TMRL3_POSITION                      0x3
#define _PWM11TMRL_PWM11TMRL3_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL3_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL3_MASK                          0x8
#define _PWM11TMRL_PWM11TMRL4_POSN                          0x4
#define _PWM11TMRL_PWM11TMRL4_POSITION                      0x4
#define _PWM11TMRL_PWM11TMRL4_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL4_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL4_MASK                          0x10
#define _PWM11TMRL_PWM11TMRL5_POSN                          0x5
#define _PWM11TMRL_PWM11TMRL5_POSITION                      0x5
#define _PWM11TMRL_PWM11TMRL5_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL5_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL5_MASK                          0x20
#define _PWM11TMRL_PWM11TMRL6_POSN                          0x6
#define _PWM11TMRL_PWM11TMRL6_POSITION                      0x6
#define _PWM11TMRL_PWM11TMRL6_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL6_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL6_MASK                          0x40
#define _PWM11TMRL_PWM11TMRL7_POSN                          0x7
#define _PWM11TMRL_PWM11TMRL7_POSITION                      0x7
#define _PWM11TMRL_PWM11TMRL7_SIZE                          0x1
#define _PWM11TMRL_PWM11TMRL7_LENGTH                        0x1
#define _PWM11TMRL_PWM11TMRL7_MASK                          0x80
#define _PWM11TMRL_PWM11TMRL_POSN                           0x0
#define _PWM11TMRL_PWM11TMRL_POSITION                       0x0
#define _PWM11TMRL_PWM11TMRL_SIZE                           0x8
#define _PWM11TMRL_PWM11TMRL_LENGTH                         0x8
#define _PWM11TMRL_PWM11TMRL_MASK                           0xFF

// Register: PWM11TMRH
#define PWM11TMRH PWM11TMRH
extern volatile unsigned char           PWM11TMRH           __at(0xDBA);
#ifndef _LIB_BUILD
asm("PWM11TMRH equ 0DBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM11TMRH0             :1;
        unsigned PWM11TMRH1             :1;
        unsigned PWM11TMRH2             :1;
        unsigned PWM11TMRH3             :1;
        unsigned PWM11TMRH4             :1;
        unsigned PWM11TMRH5             :1;
        unsigned PWM11TMRH6             :1;
        unsigned PWM11TMRH7             :1;
    };
    struct {
        unsigned PWM11TMRH              :8;
    };
} PWM11TMRHbits_t;
extern volatile PWM11TMRHbits_t PWM11TMRHbits __at(0xDBA);
// bitfield macros
#define _PWM11TMRH_TMR_POSN                                 0x0
#define _PWM11TMRH_TMR_POSITION                             0x0
#define _PWM11TMRH_TMR_SIZE                                 0x8
#define _PWM11TMRH_TMR_LENGTH                               0x8
#define _PWM11TMRH_TMR_MASK                                 0xFF
#define _PWM11TMRH_PWM11TMRH0_POSN                          0x0
#define _PWM11TMRH_PWM11TMRH0_POSITION                      0x0
#define _PWM11TMRH_PWM11TMRH0_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH0_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH0_MASK                          0x1
#define _PWM11TMRH_PWM11TMRH1_POSN                          0x1
#define _PWM11TMRH_PWM11TMRH1_POSITION                      0x1
#define _PWM11TMRH_PWM11TMRH1_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH1_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH1_MASK                          0x2
#define _PWM11TMRH_PWM11TMRH2_POSN                          0x2
#define _PWM11TMRH_PWM11TMRH2_POSITION                      0x2
#define _PWM11TMRH_PWM11TMRH2_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH2_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH2_MASK                          0x4
#define _PWM11TMRH_PWM11TMRH3_POSN                          0x3
#define _PWM11TMRH_PWM11TMRH3_POSITION                      0x3
#define _PWM11TMRH_PWM11TMRH3_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH3_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH3_MASK                          0x8
#define _PWM11TMRH_PWM11TMRH4_POSN                          0x4
#define _PWM11TMRH_PWM11TMRH4_POSITION                      0x4
#define _PWM11TMRH_PWM11TMRH4_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH4_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH4_MASK                          0x10
#define _PWM11TMRH_PWM11TMRH5_POSN                          0x5
#define _PWM11TMRH_PWM11TMRH5_POSITION                      0x5
#define _PWM11TMRH_PWM11TMRH5_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH5_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH5_MASK                          0x20
#define _PWM11TMRH_PWM11TMRH6_POSN                          0x6
#define _PWM11TMRH_PWM11TMRH6_POSITION                      0x6
#define _PWM11TMRH_PWM11TMRH6_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH6_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH6_MASK                          0x40
#define _PWM11TMRH_PWM11TMRH7_POSN                          0x7
#define _PWM11TMRH_PWM11TMRH7_POSITION                      0x7
#define _PWM11TMRH_PWM11TMRH7_SIZE                          0x1
#define _PWM11TMRH_PWM11TMRH7_LENGTH                        0x1
#define _PWM11TMRH_PWM11TMRH7_MASK                          0x80
#define _PWM11TMRH_PWM11TMRH_POSN                           0x0
#define _PWM11TMRH_PWM11TMRH_POSITION                       0x0
#define _PWM11TMRH_PWM11TMRH_SIZE                           0x8
#define _PWM11TMRH_PWM11TMRH_LENGTH                         0x8
#define _PWM11TMRH_PWM11TMRH_MASK                           0xFF

// Register: PWM11CON
#define PWM11CON PWM11CON
extern volatile unsigned char           PWM11CON            __at(0xDBB);
#ifndef _LIB_BUILD
asm("PWM11CON equ 0DBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM11MODE0             :1;
        unsigned PWM11MODE1             :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM11MODE              :2;
        unsigned PWM11POL               :1;
        unsigned PWM11OUT               :1;
        unsigned                        :1;
        unsigned PWM11EN                :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM11CONbits_t;
