MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1773/mcu.h
extern volatile __bit                   RG1ISET0            __at(0x3C98);	// @ (0x793 * 8 + 0)
#define                                 RG1ISET0_bit        _BIT_ACCESS(PRG1CON2,0)
// PRG1CON2<RG1ISET1>
extern volatile __bit                   RG1ISET1            __at(0x3C99);	// @ (0x793 * 8 + 1)
#define                                 RG1ISET1_bit        _BIT_ACCESS(PRG1CON2,1)
// PRG1CON2<RG1ISET2>
extern volatile __bit                   RG1ISET2            __at(0x3C9A);	// @ (0x793 * 8 + 2)
#define                                 RG1ISET2_bit        _BIT_ACCESS(PRG1CON2,2)
// PRG1CON2<RG1ISET3>
extern volatile __bit                   RG1ISET3            __at(0x3C9B);	// @ (0x793 * 8 + 3)
#define                                 RG1ISET3_bit        _BIT_ACCESS(PRG1CON2,3)
// PRG1CON2<RG1ISET4>
extern volatile __bit                   RG1ISET4            __at(0x3C9C);	// @ (0x793 * 8 + 4)
#define                                 RG1ISET4_bit        _BIT_ACCESS(PRG1CON2,4)
// PRG1CON0<RG1MODE0>
extern volatile __bit                   RG1MODE0            __at(0x3C8A);	// @ (0x791 * 8 + 2)
#define                                 RG1MODE0_bit        _BIT_ACCESS(PRG1CON0,2)
// PRG1CON0<RG1MODE1>
extern volatile __bit                   RG1MODE1            __at(0x3C8B);	// @ (0x791 * 8 + 3)
#define                                 RG1MODE1_bit        _BIT_ACCESS(PRG1CON0,3)
// PRG1CON0<RG1OS>
extern volatile __bit                   RG1OS               __at(0x3C89);	// @ (0x791 * 8 + 1)
#define                                 RG1OS_bit           _BIT_ACCESS(PRG1CON0,1)
// PRG1CON1<RG1RDY>
extern volatile __bit                   RG1RDY              __at(0x3C92);	// @ (0x792 * 8 + 2)
#define                                 RG1RDY_bit          _BIT_ACCESS(PRG1CON1,2)
// PRG1CON0<RG1REDG>
extern volatile __bit                   RG1REDG             __at(0x3C8C);	// @ (0x791 * 8 + 4)
#define                                 RG1REDG_bit         _BIT_ACCESS(PRG1CON0,4)
// PRG1CON1<RG1RPOL>
extern volatile __bit                   RG1RPOL             __at(0x3C90);	// @ (0x792 * 8 + 0)
#define                                 RG1RPOL_bit         _BIT_ACCESS(PRG1CON1,0)
// PRG1RTSS<RG1RTSS0>
extern volatile __bit                   RG1RTSS0            __at(0x3C70);	// @ (0x78E * 8 + 0)
#define                                 RG1RTSS0_bit        _BIT_ACCESS(PRG1RTSS,0)
// PRG1RTSS<RG1RTSS1>
extern volatile __bit                   RG1RTSS1            __at(0x3C71);	// @ (0x78E * 8 + 1)
#define                                 RG1RTSS1_bit        _BIT_ACCESS(PRG1RTSS,1)
// PRG1RTSS<RG1RTSS2>
extern volatile __bit                   RG1RTSS2            __at(0x3C72);	// @ (0x78E * 8 + 2)
#define                                 RG1RTSS2_bit        _BIT_ACCESS(PRG1RTSS,2)
// PRG1RTSS<RG1RTSS3>
extern volatile __bit                   RG1RTSS3            __at(0x3C73);	// @ (0x78E * 8 + 3)
#define                                 RG1RTSS3_bit        _BIT_ACCESS(PRG1RTSS,3)
// PRG2CON0<RG2EN>
extern volatile __bit                   RG2EN               __at(0x3CBF);	// @ (0x797 * 8 + 7)
#define                                 RG2EN_bit           _BIT_ACCESS(PRG2CON0,7)
// PRG2CON0<RG2FEDG>
extern volatile __bit                   RG2FEDG             __at(0x3CBD);	// @ (0x797 * 8 + 5)
#define                                 RG2FEDG_bit         _BIT_ACCESS(PRG2CON0,5)
// PRG2CON1<RG2FPOL>
extern volatile __bit                   RG2FPOL             __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 RG2FPOL_bit         _BIT_ACCESS(PRG2CON1,1)
// PRG2FTSS<RG2FTSS0>
extern volatile __bit                   RG2FTSS0            __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 RG2FTSS0_bit        _BIT_ACCESS(PRG2FTSS,0)
// PRG2FTSS<RG2FTSS1>
extern volatile __bit                   RG2FTSS1            __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 RG2FTSS1_bit        _BIT_ACCESS(PRG2FTSS,1)
// PRG2FTSS<RG2FTSS2>
extern volatile __bit                   RG2FTSS2            __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 RG2FTSS2_bit        _BIT_ACCESS(PRG2FTSS,2)
// PRG2FTSS<RG2FTSS3>
extern volatile __bit                   RG2FTSS3            __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 RG2FTSS3_bit        _BIT_ACCESS(PRG2FTSS,3)
// PRG2CON0<RG2GO>
extern volatile __bit                   RG2GO               __at(0x3CB8);	// @ (0x797 * 8 + 0)
#define                                 RG2GO_bit           _BIT_ACCESS(PRG2CON0,0)
// PRG2INS<RG2INS0>
extern volatile __bit                   RG2INS0             __at(0x3CB0);	// @ (0x796 * 8 + 0)
#define                                 RG2INS0_bit         _BIT_ACCESS(PRG2INS,0)
// PRG2INS<RG2INS1>
extern volatile __bit                   RG2INS1             __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 RG2INS1_bit         _BIT_ACCESS(PRG2INS,1)
// PRG2INS<RG2INS2>
extern volatile __bit                   RG2INS2             __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 RG2INS2_bit         _BIT_ACCESS(PRG2INS,2)
// PRG2INS<RG2INS3>
extern volatile __bit                   RG2INS3             __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 RG2INS3_bit         _BIT_ACCESS(PRG2INS,3)
// PRG2CON2<RG2ISET0>
extern volatile __bit                   RG2ISET0            __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 RG2ISET0_bit        _BIT_ACCESS(PRG2CON2,0)
// PRG2CON2<RG2ISET1>
extern volatile __bit                   RG2ISET1            __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 RG2ISET1_bit        _BIT_ACCESS(PRG2CON2,1)
// PRG2CON2<RG2ISET2>
extern volatile __bit                   RG2ISET2            __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 RG2ISET2_bit        _BIT_ACCESS(PRG2CON2,2)
// PRG2CON2<RG2ISET3>
extern volatile __bit                   RG2ISET3            __at(0x3CCB);	// @ (0x799 * 8 + 3)
#define                                 RG2ISET3_bit        _BIT_ACCESS(PRG2CON2,3)
// PRG2CON2<RG2ISET4>
extern volatile __bit                   RG2ISET4            __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 RG2ISET4_bit        _BIT_ACCESS(PRG2CON2,4)
// PRG2CON0<RG2MODE0>
extern volatile __bit                   RG2MODE0            __at(0x3CBA);	// @ (0x797 * 8 + 2)
#define                                 RG2MODE0_bit        _BIT_ACCESS(PRG2CON0,2)
// PRG2CON0<RG2MODE1>
extern volatile __bit                   RG2MODE1            __at(0x3CBB);	// @ (0x797 * 8 + 3)
#define                                 RG2MODE1_bit        _BIT_ACCESS(PRG2CON0,3)
// PRG2CON0<RG2OS>
extern volatile __bit                   RG2OS               __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 RG2OS_bit           _BIT_ACCESS(PRG2CON0,1)
// PRG2CON1<RG2RDY>
extern volatile __bit                   RG2RDY              __at(0x3CC2);	// @ (0x798 * 8 + 2)
#define                                 RG2RDY_bit          _BIT_ACCESS(PRG2CON1,2)
// PRG2CON0<RG2REDG>
extern volatile __bit                   RG2REDG             __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 RG2REDG_bit         _BIT_ACCESS(PRG2CON0,4)
// PRG2CON1<RG2RPOL>
extern volatile __bit                   RG2RPOL             __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 RG2RPOL_bit         _BIT_ACCESS(PRG2CON1,0)
// PRG2RTSS<RG2RTSS0>
extern volatile __bit                   RG2RTSS0            __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 RG2RTSS0_bit        _BIT_ACCESS(PRG2RTSS,0)
// PRG2RTSS<RG2RTSS1>
extern volatile __bit                   RG2RTSS1            __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 RG2RTSS1_bit        _BIT_ACCESS(PRG2RTSS,1)
// PRG2RTSS<RG2RTSS2>
extern volatile __bit                   RG2RTSS2            __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 RG2RTSS2_bit        _BIT_ACCESS(PRG2RTSS,2)
// PRG2RTSS<RG2RTSS3>
extern volatile __bit                   RG2RTSS3            __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 RG2RTSS3_bit        _BIT_ACCESS(PRG2RTSS,3)
// PRG3CON0<RG3EN>
extern volatile __bit                   RG3EN               __at(0x3CEF);	// @ (0x79D * 8 + 7)
#define                                 RG3EN_bit           _BIT_ACCESS(PRG3CON0,7)
// PRG3CON0<RG3FEDG>
extern volatile __bit                   RG3FEDG             __at(0x3CED);	// @ (0x79D * 8 + 5)
#define                                 RG3FEDG_bit         _BIT_ACCESS(PRG3CON0,5)
// PRG3CON1<RG3FPOL>
extern volatile __bit                   RG3FPOL             __at(0x3CF1);	// @ (0x79E * 8 + 1)
#define                                 RG3FPOL_bit         _BIT_ACCESS(PRG3CON1,1)
// PRG3FTSS<RG3FTSS0>
extern volatile __bit                   RG3FTSS0            __at(0x3CD8);	// @ (0x79B * 8 + 0)
#define                                 RG3FTSS0_bit        _BIT_ACCESS(PRG3FTSS,0)
// PRG3FTSS<RG3FTSS1>
extern volatile __bit                   RG3FTSS1            __at(0x3CD9);	// @ (0x79B * 8 + 1)
#define                                 RG3FTSS1_bit        _BIT_ACCESS(PRG3FTSS,1)
// PRG3FTSS<RG3FTSS2>
extern volatile __bit                   RG3FTSS2            __at(0x3CDA);	// @ (0x79B * 8 + 2)
#define                                 RG3FTSS2_bit        _BIT_ACCESS(PRG3FTSS,2)
// PRG3FTSS<RG3FTSS3>
extern volatile __bit                   RG3FTSS3            __at(0x3CDB);	// @ (0x79B * 8 + 3)
#define                                 RG3FTSS3_bit        _BIT_ACCESS(PRG3FTSS,3)
// PRG3CON0<RG3GO>
extern volatile __bit                   RG3GO               __at(0x3CE8);	// @ (0x79D * 8 + 0)
#define                                 RG3GO_bit           _BIT_ACCESS(PRG3CON0,0)
// PRG3INS<RG3INS0>
extern volatile __bit                   RG3INS0             __at(0x3CE0);	// @ (0x79C * 8 + 0)
#define                                 RG3INS0_bit         _BIT_ACCESS(PRG3INS,0)
// PRG3INS<RG3INS1>
extern volatile __bit                   RG3INS1             __at(0x3CE1);	// @ (0x79C * 8 + 1)
#define                                 RG3INS1_bit         _BIT_ACCESS(PRG3INS,1)
// PRG3INS<RG3INS2>
extern volatile __bit                   RG3INS2             __at(0x3CE2);	// @ (0x79C * 8 + 2)
#define                                 RG3INS2_bit         _BIT_ACCESS(PRG3INS,2)
// PRG3INS<RG3INS3>
extern volatile __bit                   RG3INS3             __at(0x3CE3);	// @ (0x79C * 8 + 3)
#define                                 RG3INS3_bit         _BIT_ACCESS(PRG3INS,3)
// PRG3CON2<RG3ISET0>
extern volatile __bit                   RG3ISET0            __at(0x3CF8);	// @ (0x79F * 8 + 0)
#define                                 RG3ISET0_bit        _BIT_ACCESS(PRG3CON2,0)
// PRG3CON2<RG3ISET1>
extern volatile __bit                   RG3ISET1            __at(0x3CF9);	// @ (0x79F * 8 + 1)
#define                                 RG3ISET1_bit        _BIT_ACCESS(PRG3CON2,1)
// PRG3CON2<RG3ISET2>
extern volatile __bit                   RG3ISET2            __at(0x3CFA);	// @ (0x79F * 8 + 2)
#define                                 RG3ISET2_bit        _BIT_ACCESS(PRG3CON2,2)
// PRG3CON2<RG3ISET3>
extern volatile __bit                   RG3ISET3            __at(0x3CFB);	// @ (0x79F * 8 + 3)
#define                                 RG3ISET3_bit        _BIT_ACCESS(PRG3CON2,3)
// PRG3CON2<RG3ISET4>
extern volatile __bit                   RG3ISET4            __at(0x3CFC);	// @ (0x79F * 8 + 4)
#define                                 RG3ISET4_bit        _BIT_ACCESS(PRG3CON2,4)
// PRG3CON0<RG3MODE0>
extern volatile __bit                   RG3MODE0            __at(0x3CEA);	// @ (0x79D * 8 + 2)
#define                                 RG3MODE0_bit        _BIT_ACCESS(PRG3CON0,2)
// PRG3CON0<RG3MODE1>
extern volatile __bit                   RG3MODE1            __at(0x3CEB);	// @ (0x79D * 8 + 3)
#define                                 RG3MODE1_bit        _BIT_ACCESS(PRG3CON0,3)
// PRG3CON0<RG3OS>
extern volatile __bit                   RG3OS               __at(0x3CE9);	// @ (0x79D * 8 + 1)
#define                                 RG3OS_bit           _BIT_ACCESS(PRG3CON0,1)
// PRG3CON1<RG3RDY>
extern volatile __bit                   RG3RDY              __at(0x3CF2);	// @ (0x79E * 8 + 2)
#define                                 RG3RDY_bit          _BIT_ACCESS(PRG3CON1,2)
// PRG3CON0<RG3REDG>
extern volatile __bit                   RG3REDG             __at(0x3CEC);	// @ (0x79D * 8 + 4)
#define                                 RG3REDG_bit         _BIT_ACCESS(PRG3CON0,4)
// PRG3CON1<RG3RPOL>
extern volatile __bit                   RG3RPOL             __at(0x3CF0);	// @ (0x79E * 8 + 0)
#define                                 RG3RPOL_bit         _BIT_ACCESS(PRG3CON1,0)
// PRG3RTSS<RG3RTSS0>
extern volatile __bit                   RG3RTSS0            __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 RG3RTSS0_bit        _BIT_ACCESS(PRG3RTSS,0)
// PRG3RTSS<RG3RTSS1>
extern volatile __bit                   RG3RTSS1            __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 RG3RTSS1_bit        _BIT_ACCESS(PRG3RTSS,1)
// PRG3RTSS<RG3RTSS2>
extern volatile __bit                   RG3RTSS2            __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 RG3RTSS2_bit        _BIT_ACCESS(PRG3RTSS,2)
// PRG3RTSS<RG3RTSS3>
extern volatile __bit                   RG3RTSS3            __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 RG3RTSS3_bit        _BIT_ACCESS(PRG3RTSS,3)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4D8);	// @ (0x9B * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4D9);	// @ (0x9B * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// SSP1CON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SLRA3_bit           _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRA6>
extern volatile __bit                   SLRA6               __at(0x1866);	// @ (0x30C * 8 + 6)
#define                                 SLRA6_bit           _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRA7>
extern volatile __bit                   SLRA7               __at(0x1867);	// @ (0x30C * 8 + 7)
#define                                 SLRA7_bit           _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRB0>
extern volatile __bit                   SLRB0               __at(0x1868);	// @ (0x30D * 8 + 0)
#define                                 SLRB0_bit           _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRB1>
extern volatile __bit                   SLRB1               __at(0x1869);	// @ (0x30D * 8 + 1)
#define                                 SLRB1_bit           _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRB2>
extern volatile __bit                   SLRB2               __at(0x186A);	// @ (0x30D * 8 + 2)
#define                                 SLRB2_bit           _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRB3>
extern volatile __bit                   SLRB3               __at(0x186B);	// @ (0x30D * 8 + 3)
#define                                 SLRB3_bit           _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SLRB6_bit           _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0x186F);	// @ (0x30D * 8 + 7)
#define                                 SLRB7_bit           _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRC6>
extern volatile __bit                   SLRC6               __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 SLRC6_bit           _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRC7>
extern volatile __bit                   SLRC7               __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 SLRC7_bit           _BIT_ACCESS(SLRCONC,7)
// SSP1STAT<SMP>
extern volatile __bit                   SMP                 __at(0x10A7);	// @ (0x214 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSP1STAT,7)
// OSCSTAT<SOSCR>
extern volatile __bit                   SOSCR               __at(0x4E7);	// @ (0x9C * 8 + 7)
#define                                 SOSCR_bit           _BIT_ACCESS(OSCSTAT,7)
// OPA3CON<SP>
extern volatile __bit                   SP                  __at(0x28CE);	// @ (0x519 * 8 + 6)
#define                                 SP_bit              _BIT_ACCESS(OPA3CON,6)
// RC1STA<SPEN>
extern volatile __bit                   SPEN                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RC1STA,7)
// OSCCON<SPLLEN>
extern volatile __bit                   SPLLEN              __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 SPLLEN_bit          _BIT_ACCESS(OSCCON,7)
// RC1STA<SREN>
extern volatile __bit                   SREN                __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RC1STA,5)
// SSP1ADD<SSP1ADD0>
extern volatile __bit                   SSP1ADD0            __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 SSP1ADD0_bit        _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<SSP1ADD1>
extern volatile __bit                   SSP1ADD1            __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 SSP1ADD1_bit        _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<SSP1ADD2>
extern volatile __bit                   SSP1ADD2            __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 SSP1ADD2_bit        _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<SSP1ADD3>
extern volatile __bit                   SSP1ADD3            __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 SSP1ADD3_bit        _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<SSP1ADD4>
extern volatile __bit                   SSP1ADD4            __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 SSP1ADD4_bit        _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<SSP1ADD5>
extern volatile __bit                   SSP1ADD5            __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 SSP1ADD5_bit        _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<SSP1ADD6>
extern volatile __bit                   SSP1ADD6            __at(0x1096);	// @ (0x212 * 8 + 6)
#define                                 SSP1ADD6_bit        _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<SSP1ADD7>
extern volatile __bit                   SSP1ADD7            __at(0x1097);	// @ (0x212 * 8 + 7)
#define                                 SSP1ADD7_bit        _BIT_ACCESS(SSP1ADD,7)
// SSP1BUF<SSP1BUF0>
extern volatile __bit                   SSP1BUF0            __at(0x1088);	// @ (0x211 * 8 + 0)
#define                                 SSP1BUF0_bit        _BIT_ACCESS(SSP1BUF,0)
// SSP1BUF<SSP1BUF1>
